[
  {
    "cost": 15050,
    "description": "You gain a +1 bonus to AC while wielding this shield. Shield Bash. When you are hit by a melee attack while wielding this shield, you can use your reaction to force the attacker to make a DC 16 Dexterity saving throw. On a failed save, the attacker is knocked prone. The shield has 3 charges and regains 1d3 expended charges daily at dawn. You can expend 1 charge to cast protection from evil and good. This item requires attunement.",
    "descriptors": [],
    "name": "Abdel's Trusted Shield",
    "rarity": "Very Rare",
    "type": "Shield"
  },
  {
    "cost": 1560,
    "description": "While wearing this amulet, you have advantage on attack rolls against aberrations, and aberrations have disadvantage on attack rolls against you. If you are a githyanki, you also have advantage on Intelligence saving throws while wearing this amulet. This item requires attunement.",
    "descriptors": [],
    "name": "Aberration Hunter's Amulet",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 407,
    "description": "While wearing this amulet, you gain a +1 bonus to Charisma (Performance) checks, but you have disadvantage on Charisma (Intimidation) checks.",
    "descriptors": [],
    "name": "Absolute Confidence Amulet",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 4450,
    "description": "While wearing these gloves, creatures you summon have resistance to all damage except psychic. At the start of each of your summoned creature's turns, it must succeed on a DC 16 Wisdom saving throw or use its action to make one melee attack against a random creature within reach. If no creature is within reach, the summoned creature does nothing on that turn. This item requires attunement.",
    "descriptors": [],
    "name": "Abyss Beckoners",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 1310,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity (Acrobatics) checks and have advantage on Dexterity saving throws.",
    "descriptors": [],
    "name": "Acrobat Shoes",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 4030,
    "description": "This ring When you drop to 0 hit points while wearing this ring, you can use your reaction to expend the charge. If you do, you instead drop to half your hit point maximum (rounded down). On your next turn, you must use your action to make one melee weapon attack against the nearest creature. If no creature is within reach, you must move toward the nearest creature. This item requires attunement.",
    "descriptors": [],
    "name": "After Death Do Us Part",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 1467,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. When you hit a creature that hasn't taken a turn in combat yet with this weapon, the target takes an extra 1d6 necrotic damage. You gain a +1 bonus to initiative rolls and have advantage on Wisdom (Perception) checks while you have this weapon on your person. This item requires attunement.",
    "descriptors": [],
    "name": "Ambusher (Shortsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 25250,
    "description": "While wearing this amulet, creatures at their hit point maximum are vulnerable to your melee weapon attacks. This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of Bhaal",
    "rarity": "Legendary",
    "type": "Amulet"
  },
  {
    "cost": 48350,
    "description": "Your Constitution score is 23 while you wear this amulet. It has no effect if your Constitution is already 23 or higher. Additionally, you have advantage on Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of Greater Health",
    "rarity": "Legendary",
    "type": "Amulet"
  },
  {
    "cost": 465,
    "description": "This amulet While wearing it, you can use an action to cast misty step. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Amulet of Misty Step",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 740,
    "description": "This amulet has 3 charges and regains 1d3 expended charges daily at dawn. While wearing the amulet, you can use an action to expend charges to cast one of the following spells: healing word (1 charge) or mass healing word (3 charges). This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of Restoration",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 465,
    "description": "This amulet While wearing it, you can use an action to cast lesser restoration. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Amulet of Silvanus",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 2650,
    "description": "While wearing this amulet, your spell save DC increases by 2. Additionally, you gain one additional use of your Channel Divinity feature. Once you use this additional Channel Divinity, you can't do so again until you finish a long rest. This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of the Devout",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 3515,
    "description": "While wearing this amulet, you have advantage on Wisdom saving throws. The amulet has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast shield. This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of the Harpers",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 612,
    "description": "While wearing this amulet, you have resistance to slashing damage and vulnerability to bludgeoning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Amulet of the Unworthy",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 375,
    "description": "While you have the Patient Defense feature active and are wearing this garment, when a creature misses you with an attack, you can use your reaction to make one unarmed strike against that creature. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Uninhibited Kushigo",
    "rarity": "Uncommon",
    "type": "Clothing"
  },
  {
    "cost": 11980,
    "description": "While wearing this hood, you have darkvision out to a range of 10 feet. If you already have darkvision, its range increases by 10 feet. You gain a +2 bonus to initiative rolls. The cowl has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast see invisibility. This item requires attunement.",
    "descriptors": [],
    "name": "Assassin of Bhaal Cowl",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 697,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. While this weapon is on your person, you have advantage on Dexterity (Stealth) checks.",
    "descriptors": [],
    "name": "Assassin's Shortsword (Shortsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 728,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. When you hit a prone creature with this magic dagger, the target takes an extra 1d4 necrotic damage.",
    "descriptors": [],
    "name": "Assassin's Touch (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 39050,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. When you hit with an attack using this sword, you add double your Strength modifier to the damage roll. You have advantage on attack rolls against Large, Huge, or Gargantuan creatures. The sword As a bonus action, you can gain the effect of the enlarge/reduce spell (enlarge only) for 1 minute. Once you use this property, you can\\'t use it again until the next dawn. This effect doesn't require concentration. This item requires attunement.",
    "descriptors": [],
    "name": "Balduran's Giantslayer (Greatsword)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 575,
    "description": "While wearing this ring, when you hit a creature with a weapon attack, you can cast an illusion or enchantment spell of 1st level or higher as a bonus action on that turn. This item requires attunement.",
    "descriptors": [],
    "name": "Band of the Mystic Scoundrel",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 420,
    "description": "This amulet While wearing it, you can use an action to cast animal friendship (save DC 12). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Beastmaster's Chain",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 3275,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. While wielding this weapon, you can make one additional melee weapon attack as a bonus action on each of your turns. This item requires attunement.",
    "descriptors": [],
    "name": "Belm (Scimitar)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1375,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The quarterstaff you can use a bonus action to cast enlarge/reduce (enlarge only, targeting yourself). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Bigboy's Chew Toy (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 7915,
    "description": "While wearing this crown, your Charisma score increases by 2, to a maximum of 22. This item requires attunement.",
    "descriptors": [],
    "name": "Birthright",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 1235,
    "description": "While wearing these gauntlets, you gain a +1 bonus to Strength saving throws and a +1 bonus to attack rolls with melee weapons. The gauntlets you can use an action to cast inflict wounds. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Blackguard's Gauntlets",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 635,
    "description": "While wearing these boots, you gain a +1 bonus to Strength (Athletics) checks. The boots you can use an action to cast longstrider. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Blackguard's Greaves",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 1840,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this sword while using Divine Smite or a similar smiting feature, the target must succeed on a DC 14 Constitution saving throw or be stunned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Blackguard's Sword (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 384,
    "description": "While wearing this jacket, when you grant a Bardic Inspiration die to a creature, that creature also gains 4 temporary hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Blazer of Benevolence",
    "rarity": "Uncommon",
    "type": "Clothing"
  },
  {
    "cost": 15512,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you attack a gnome or dwarf with this weapon, you gain an additional 1d4 bonus to both the attack and damage rolls. When you score a critical hit with this weapon, the target's walking speed is reduced by half until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Blightbringer (Shortbow)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1390,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. This weapon only functions if you are an Eldritch Knight who has bonded with it using your Weapon Bond feature, or if it is your pact weapon as a warlock. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit with this weapon, you deal additional damage equal to your proficiency bonus. This item requires attunement.",
    "descriptors": [],
    "name": "Blood-Bound Blade (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 917,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. While you have half your hit points or fewer, this weapon deals an extra 1d4 slashing damage on a hit. This item requires attunement.",
    "descriptors": [],
    "name": "Blooded Greataxe (Greataxe)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 41752,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. The number you need to roll a critical hit with this weapon is reduced by 1 (this effect stacks with similar effects). When you hit a creature with this weapon, that creature becomes vulnerable to piercing damage until the start of your next turn. While dual wielding weapons (with this weapon as one of them), when a creature misses you with a melee attack, you can use your reaction to make one melee weapon attack with this dagger against that creature with advantage. You gain a +1 bonus to AC while wielding this dagger. This item requires attunement.",
    "descriptors": [],
    "name": "Bloodthirst (Dagger)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 8545,
    "description": "While wearing these boots and not wearing armor or wielding a shield, you gain a +1 bonus to AC and saving throws. Your jump distance increases by 5 feet. Brutal Leap. As a bonus action, you can leap at least 10 feet toward a creature. When you land, the target must succeed on a DC 16 Strength saving throw or be knocked prone. This item requires attunement.",
    "descriptors": [],
    "name": "Bonespike Boots",
    "rarity": "Very Rare",
    "type": "Boots"
  },
  {
    "cost": 2691,
    "description": "While wearing this garment, all damage you take is reduced by 2 (minimum of 1 damage). When you enter a rage while wearing this garment, you gain 2d8 temporary hit points. When a creature hits you with a melee attack while you're raging, the attacker takes 3 piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Bonespike Garb",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 2650,
    "description": "While wearing these gloves, your attacks ignore resistance to slashing, piercing, and bludgeoning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Bonespike Gloves",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 9040,
    "description": "While wearing this helm, you gain a +2 bonus to Charisma (Intimidation) checks. When you enter a rage, each creature of your choice within 10 feet of you must succeed on a DC 16 Wisdom saving throw or take 2d4 psychic damage. Creatures that succeed on the saving throw take half damage. The helmet has 3 charges and regains 1d3 expended charges daily at dawn. When you hit a creature with a weapon attack, you can expend 1 charge to force the target to make a DC 16 Wisdom saving throw. On a failed save, the target is frightened of you until the end of your next turn. If you expend a charge in this way, you add 1d8 to the attack's damage roll. This item requires attunement.",
    "descriptors": [],
    "name": "Bonespike Helmet",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 382,
    "description": "While wearing these boots, when you cast a spell that restores hit points to a single creature, that creature gains 3 temporary hit points.",
    "descriptors": [],
    "name": "Boots of Aid and Comfort",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 350,
    "description": "These boots have 3 charges and regain 1d3 expended charges daily at dawn. While wearing them, you can use an action to expend 1 charge to cast feign death. This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Apparent Death",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 350,
    "description": "These boots While wearing these boots, you can use a bonus action to regain one expended use of your Bardic Inspiration. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Brilliance",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 2870,
    "description": "While wearing these boots, you gain a +1 bonus to Strength (Athletics) checks. Whenever you deal acid, cold, fire, lightning, or thunder damage with a spell or cantrip, your walking speed increases by 5 feet until the end of your next turn.",
    "descriptors": [],
    "name": "Boots of Elemental Momentum",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 462,
    "description": "While wearing these boots, difficult terrain doesn't cost you extra movement.",
    "descriptors": [],
    "name": "Boots of Genial Striding",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 15085,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity saving throws. Your walking speed increases by 10 feet, and difficult terrain doesn't cost you extra movement. Additionally, you ignore the effects of difficult terrain caused by magic, and you can't be restrained by magical means. This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Persistence",
    "rarity": "Very Rare",
    "type": "Boots"
  },
  {
    "cost": 9482,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity saving throws. The boots have 3 charges and regain 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast fly. While flying, if you make a melee weapon attack, you deal an extra 1d4 psychic damage on your next hit before you land. This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Psionic Movement",
    "rarity": "Very Rare",
    "type": "Boots"
  },
  {
    "cost": 350,
    "description": "While wearing these boots, your unarmed strikes deal additional bludgeoning damage equal to your Wisdom modifier (minimum of 1). This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Uninhibited Kushigo",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 375,
    "description": "These boots have 3 charges and regain 1d3 expended charges daily at dawn. While wearing these boots, you can use a bonus action to expend 1 charge to teleport up to 30 feet to an unoccupied space you can see. Your clothing and armor are left behind when you teleport in this way. This item requires attunement.",
    "descriptors": [],
    "name": "Boots of Very Fast Blinking",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 870,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. While this bow is on your person, you gain a +1 bonus to initiative rolls.",
    "descriptors": [],
    "name": "Bow of Awareness (Shortbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1602,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Against frightened creatures, you gain an additional 1d4 bonus to attack and damage rolls. When you hit a creature with this weapon, it must succeed on a DC 14 Wisdom saving throw or become frightened of you until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Bow of the Banshee (Shortbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1090,
    "description": "While wearing this ring, when you shove a creature, you gain a +1 bonus to AC until the start of your next turn.",
    "descriptors": [],
    "name": "Bracing Band",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 350,
    "description": "While wearing these gloves, when you deal psychic damage to a creature, it must succeed on a DC 14 Intelligence saving throw or suffer a 1d4 penalty to all ability checks, saving throws, and attack rolls until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Braindrain Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 755,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 piercing damage. This magic pike is well-crafted but has no additional magical properties beyond being a magic weapon for purposes of overcoming resistance. This item requires attunement.",
    "descriptors": [],
    "name": "Breaching Pikestaff (Pike)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 419,
    "description": "While wearing this amulet, when you regain hit points, your weapon attacks deal an extra 1d4 poison damage for the next 3 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Broodmother's Revenge",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 375,
    "description": "While wearing this circlet, when you are within 5 feet of a hostile creature, your spell save DC increases by 1. This item requires attunement.",
    "descriptors": [],
    "name": "Browbeaten Circlet",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 4540,
    "description": "While wearing this ring, you can use an action to target one creature you can see within 60 feet. Once you use this property, you can\\'t use it again until the next dawn. The target must succeed on a DC 16 Constitution saving throw or be paralyzed until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Burnished Ring",
    "rarity": "Very Rare",
    "type": "Ring"
  },
  {
    "cost": 4557,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The quarterstaff has 3 charges and regains 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge. The next time you hit with a melee weapon attack during this turn, your attack deals an extra 2d6 thunder damage, and the target must succeed on a DC 14 Strength saving throw or be pushed 10 feet away from you. This item requires attunement.",
    "descriptors": [],
    "name": "Cacophony (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 390,
    "description": "While wearing this ring, your weapon attacks deal an extra 2 radiant damage to creatures standing in bright light.",
    "descriptors": [],
    "name": "Callous Glow Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 391,
    "description": "While wearing this cap, when you grant a Bardic Inspiration die to a creature, that creature also regains 1d6 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Cap of Curing",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 875,
    "description": "While wearing this cap, if you start your turn with half your hit points or fewer, you gain a +1 bonus to attack rolls until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Cap of Wrath",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 390,
    "description": "While wearing this ring, your weapon attacks deal an extra 2 acid damage.",
    "descriptors": [],
    "name": "Caustic Band",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 800,
    "description": "While wearing this amulet, you can use a bonus action to touch one willing creature.  For the next hour, that creature gains a +2 bonus to Charisma (Intimidation) checks. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Champion's Chain",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 1537,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. This weapon only functions if you are an Eldritch Knight who has bonded with it using your Weapon Bond feature, or if it is your pact weapon as a warlock. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit with this weapon, you deal an extra 1d6 lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Charge-Bound Warhammer (Warhammer)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 375,
    "description": "While wearing this cloak, when a creature within 5 feet of you hits you with an attack, that creature takes 1d4 fire damage.",
    "descriptors": [],
    "name": "Cindermoth Cloak",
    "rarity": "Uncommon",
    "type": "Cloak"
  },
  {
    "cost": 4850,
    "description": "These gloves have 3 charges and regain 1d3 expended charges daily at dawn. While wearing these gloves, you can use a reaction to expend 1 charge when you are targeted by a ranged weapon attack. You gain a +5 bonus to AC against that attack and all other ranged weapon attacks until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Cindersnap Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 2937,
    "description": "While wearing this circlet, when you deal fire damage with a spell of 1st level or higher (not a cantrip), you gain an additional bonus action on that turn. This item requires attunement.",
    "descriptors": [],
    "name": "Circlet of Fire",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 2650,
    "description": "While wearing this circlet, you gain a 1d4 bonus to attack rolls against creatures marked by hunter's mark, true strike, faerie fire, or guiding bolt. This item requires attunement.",
    "descriptors": [],
    "name": "Circlet of Hunting",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 547,
    "description": "While wearing this circlet, when an enemy fails a Charisma, Intelligence, or Wisdom saving throw against one of your spells or cantrips, you regain 1d4 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Circlet of Mental Anguish",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 575,
    "description": "While wearing this circlet, you gain a +1 bonus to Intelligence, Wisdom, and Charisma saving throws. When you succeed on a Charisma, Intelligence, or Wisdom saving throw against a spell or effect created by a creature you can see, that creature takes 1d4 psychic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Circlet of Psionic Revenge",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 375,
    "description": "While wearing this cloak, when you take the Disengage action, you create a 10-foot-radius sphere of fog centered on you that lasts until the start of your next turn. The sphere spreads around corners, and its area is heavily obscured.",
    "descriptors": [],
    "name": "Cloak of Cunning Brume",
    "rarity": "Uncommon",
    "type": "Cloak"
  },
  {
    "cost": 427,
    "description": "While wearing this cloak, you can cast absorb elements at will, without expending a spell slot. This item requires attunement.",
    "descriptors": [],
    "name": "Cloak of Elemental Absorption",
    "rarity": "Uncommon",
    "type": "Cloak"
  },
  {
    "cost": 1205,
    "description": "While wearing this garment, you are immune to being frightened and can't be affected by other emotion-altering conditions (such as charm person or fear). You have advantage on Charisma (Intimidation) and Wisdom (Insight) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Cloth of Authority",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 1420,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you score a critical hit with this weapon, both you and the target must succeed on a DC 14 Wisdom saving throw or fall prone and become incapacitated with laughter for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. This item requires attunement.",
    "descriptors": [],
    "name": "Clown Hammer (Warhammer)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2595,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. Your Strength score is 19 while you wield this magic club. It has no effect if your Strength is already 19 or higher. This item requires attunement.",
    "descriptors": [],
    "name": "Club of Hill Giant Strength (Club)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1377,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While dual wielding weapons (with this weapon as one of them), when a creature misses you with a melee attack, it must succeed on a DC 14 Constitution saving throw or have its movement speed reduced by half until the end of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Cold Snap (Dagger)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2180,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to unarmed strike attack and damage rolls. While you are not wearing armor, you gain a +2 bonus to saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Corellon's Grace (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 350,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 bludgeoning damage. Grand Slam. Once on each of your turns when you attack with this weapon, you can choose to slam the weapon into the ground instead of making a normal attack. Each creature within 10 feet of you must make a DC 14 Constitution saving throw, taking thunder damage equal to your proficiency bonus on a failed save, or half as much damage on a successful one. Creatures that fail the save are also pushed 5 feet away from you. This item requires attunement.",
    "descriptors": [],
    "name": "Corpsegrinder (Maul)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 760,
    "description": "Martial melee weapon dealing 1d8 bludgeoning damage. Once per turn when you hit a creature with this weapon, you can deal extra acid damage equal to your proficiency bonus. If you do, the target's AC is reduced by 2 until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Corrosive Flail (Flail)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 403,
    "description": "While wearing this ring, when you deal damage to a creature standing in bright light, you deal an extra 1d4 radiant damage.",
    "descriptors": [],
    "name": "Coruscation Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 5800,
    "description": "While wearing this amulet, your long jump and high jump distances increase by 5 feet. While you are under the effects of Wild Shape or a polymorph spell, you are under the constant effect of feather fall. The amulet you can use an action to cast polymorph on yourself, transforming into a dire raven (use giant eagle statistics but the creature is size Medium and has flying speed 60 feet). Once you use this property, you can\\'t use it again until the next dawn. This transformation lasts for 1 hour. This item requires attunement.",
    "descriptors": [],
    "name": "Corvid Token",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 1398,
    "description": "While wearing this hood, you gain a +1 bonus to Dexterity saving throws. While you are hidden or invisible, the number you need to roll for a critical hit with weapon attacks is reduced by 1 (this effect stacks with similar effects). This item requires attunement.",
    "descriptors": [],
    "name": "Covert Cowl",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 1022,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. When you score a critical hit with a weapon attack, the target takes an extra 1d6 force damage. This item requires attunement.",
    "descriptors": [],
    "name": "Craterflesh Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1810,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you deal acid, fire, lightning, radiant, or necrotic damage with this weapon or a spell, you gain resistance to that damage type until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Creation's Echo (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 36247,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. Main Hand. When wielding this weapon in your main hand, you deal an extra 1d4 piercing damage to creatures that have half their hit points or fewer. When you make an attack with advantage using this weapon, you deal an extra 7 piercing damage. Off-Hand. When wielding this weapon in your off hand, you can add your ability modifier to the damage of attacks made with this weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Crimson Mischief (Shortsword)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 1073,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Your ranged attacks with this weapon deal an extra 1d4 force damage.",
    "descriptors": [],
    "name": "Crossbow of Arcane Force (Heavy Crossbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 460,
    "description": "While wearing this ring, your walking speed increases by 10 feet.",
    "descriptors": [],
    "name": "Crusher's Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 3700,
    "description": "While wearing this ring, you can use an action to cast create undead. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Crypt Lord Ring",
    "rarity": "Very Rare",
    "type": "Ring"
  },
  {
    "cost": 710,
    "description": "While wearing these gloves, you gain a +1 bonus to spell attack rolls. You can make ranged spell attacks against hostile creatures within 5 feet of you without disadvantage. Additionally, when a hostile creature is within 5 feet of you, you can choose to make your ranged spell attacks as melee spell attacks. This item requires attunement.",
    "descriptors": [],
    "name": "Daredevil Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 875,
    "description": "While wearing these gloves, you gain a +1 bonus to Dexterity (Sleight of Hand) checks and a +1 bonus to attack rolls when throwing weapons or objects. When you hit a creature with a thrown weapon while wearing these gloves, the target must succeed on a DC 14 Dexterity saving throw or swap positions with you. This item requires attunement.",
    "descriptors": [],
    "name": "Dark Displacement Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1750,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While carrying this bow, you have resistance to fire and cold damage. The bow you can use a bonus action to cast haste on yourself. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Darkfire Shortbow (Shortbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1385,
    "description": "Martial melee weapon dealing 1d8 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While wielding this weapon, all bludgeoning, piercing, and slashing damage you take is reduced by 1 (minimum of 1 damage). This item requires attunement.",
    "descriptors": [],
    "name": "Defender Flail (Flail)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 547,
    "description": "While wearing this cloak, when you poison a creature, you regain 1d4 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Derivation Cloak",
    "rarity": "Rare",
    "type": "Cloak"
  },
  {
    "cost": 975,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While wielding this staff, you gain a +1 bonus to spell save DC and spell attack rolls. This item requires attunement.",
    "descriptors": [],
    "name": "Despair of Athkatla (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 37005,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. The mace You can use an action to create a 10-foot-radius aura of healing incense centered on you. Once you use this property, you can\\'t use it again until the next dawn. The aura lasts for 1 minute. When a creature starts its turn in the aura or enters it for the first time on a turn, that creature regains 1d6 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Devotee's Mace (Mace)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 350,
    "description": "While wearing this diadem, when you inflict a condition on a creature with a spell or weapon attack, your spell save DC increases by 1 for the next 2 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Diadem of Arcane Synergy",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 3010,
    "description": "While wearing these boots, you are immune to being grappled or restrained by webs, vines, or similar effects, and you can't be knocked prone by slippery surfaces such as ice or grease. The boots have 3 charges and regain 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge to cast misty step. This item requires attunement.",
    "descriptors": [],
    "name": "Disintegrating Night Walkers",
    "rarity": "Very Rare",
    "type": "Boots"
  },
  {
    "cost": 407,
    "description": "While wearing this ring, you can cast mage hand at will.",
    "descriptors": [],
    "name": "Djinni Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1447,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you score a critical hit with this weapon, the target takes an extra 7 necrotic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Dolor Amarus (Dagger)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1098,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 bludgeoning damage. When you hit a creature with this magic weapon, it can't regain hit points until the start of your next turn. Undead creatures hit by this weapon also have disadvantage on attack rolls until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Doom Hammer (Maul)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 708,
    "description": "Simple melee weapon with light and thrown (range 20/60) properties, dealing 1d6 slashing damage. When you hit a creature that is on fire with this magic handaxe, the target takes an extra 1d4 slashing damage.",
    "descriptors": [],
    "name": "Dragon's Grasp (Handaxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 8635,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. While wielding this glaive, creatures have disadvantage on saving throws against your breath weapon (if you are a dragonborn). The glaive has 3 charges and regains 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge to imbue this weapon with elemental energy for 1 minute. Choose acid, cold, fire, lightning, or poison. For the duration, attacks with this weapon deal an extra 1d6 damage of the chosen type. This item requires attunement.",
    "descriptors": [],
    "name": "Drakethroat Glaive (Glaive)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 899,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. When you hit a creature with this weapon while you are hidden, the target takes an extra 1d6 necrotic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Dread Iron Dagger (Dagger)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1535,
    "description": "While you are poisoned (such as from alcohol) and wearing this garment, you have advantage on Constitution saving throws and gain temporary hit points equal to your Constitution modifier (minimum of 1) at the start of each of your turns. This item requires attunement.",
    "descriptors": [],
    "name": "Drunken Cloth",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 80525,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. While your off-hand is empty and you are wielding only this weapon, you score a critical hit on a roll of 19 or 20, and you can take one additional reaction each round. When you hit with this weapon, you deal extra necrotic damage equal to your proficiency bonus. The rapier has 3 charges and regains 1d3 expended charges daily at dawn. You can expend charges to cast the following spells: compelled duel (1 charge), or as a bonus action, you can expend 1 charge to gain advantage on all attack rolls with this weapon until the end of your turn. This item requires attunement.",
    "descriptors": [],
    "name": "Duellist's Prerogative (Rapier)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 9737,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Your Charisma score increases by 2, to a maximum of 20, while you wield this sword. When you reduce a creature to 0 hit points with this weapon, each ally within 30 feet of you gains temporary hit points equal to your Charisma modifier (minimum of 1). The sword has 3 charges and regains 1d3 expended charges daily at dawn. When an ally you can see within 30 feet is about to make an attack, you can use your reaction and expend 1 charge to direct them. That ally can make one weapon attack as part of the same reaction. This item requires attunement.",
    "descriptors": [],
    "name": "Duke Ravengard's Longsword (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2085,
    "description": "While wearing this garment, your Constitution score increases by 2, to a maximum of 20. When you enter a rage while wearing this garment, for the next 2 rounds, your melee weapon attacks deal an extra 1d4 damage. This item requires attunement.",
    "descriptors": [],
    "name": "Enraging Heart Garb",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 800,
    "description": "While wearing this amulet, you can use a bonus action to touch one willing creature.  For the next hour, that creature gains a +2 bonus to Charisma (Persuasion) checks. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Envoy's Amulet",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 1700,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity (Acrobatics) checks and a +1 bonus to AC.",
    "descriptors": [],
    "name": "Evasive Shoes",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 744,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. This weapon deals an extra 1d4 fire damage on a hit.",
    "descriptors": [],
    "name": "Everburn Blade (Greatsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 587,
    "description": "While wearing this ring, you are immune to the blinded condition. This item requires attunement.",
    "descriptors": [],
    "name": "Eversight Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 395,
    "description": "While wearing this ring, you gain a +1 bonus to Wisdom (Survival) and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Explorer's Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 741,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. When you hit a plant creature, insect, or Small or smaller creature with this magic weapon, the target takes an extra 1d6 fire damage.",
    "descriptors": [],
    "name": "Exterminator's Axe (Greataxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 17370,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. The crossbow has 3 charges and regains 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge to fire an illuminating bolt at a point you can see within range. The bolt explodes in a 20-foot-radius sphere of bright light centered on that point. Each creature in the area must make a DC 16 Constitution saving throw or be blinded until the end of your next turn. The light lasts for 1 minute. This item requires attunement.",
    "descriptors": [],
    "name": "Fabricated Arbalest (Heavy Crossbow)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1397,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. When you hit a creature with this magic weapon, you can choose to fill it with dread. The target must succeed on a DC 12 Wisdom saving throw or have disadvantage on attack rolls and ability checks until the end of your next turn. Once you use this property, you can't use it again until you finish a short or long rest. This item requires attunement.",
    "descriptors": [],
    "name": "Faithbreaker (Warhammer)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 415,
    "description": "While wearing this ring, you gain a +2 bonus to death saving throws.",
    "descriptors": [],
    "name": "Family Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 470,
    "description": "While wearing this ring, you can use an action to cast invisibility on yourself. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Fetish of Callarduran Smoothhands",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 4000,
    "description": "While wearing this amulet, you have advantage on Intelligence, Wisdom, and Charisma saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Fey Semblance Amulet",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 403,
    "description": "While wearing this amulet, when you take fire damage from a creature, your next weapon attack before the end of your next turn deals an extra 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Fireheart",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 778,
    "description": "Martial ranged weapon with ammunition (range 30/120), light, and loading properties, dealing 1d6 piercing damage. When you hit a creature that is on fire with this magic weapon, the target takes an extra 1d4 piercing damage.",
    "descriptors": [],
    "name": "Firestoker (Hand Crossbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 395,
    "description": "While wearing this ring, you gain a +1 bonus to Charisma (Deception) checks.",
    "descriptors": [],
    "name": "Firzu's Ring of Trading",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 775,
    "description": "While wearing this helm, you gain a +1 bonus to spell save DC and a +1 bonus to initiative rolls. This item requires attunement.",
    "descriptors": [],
    "name": "Fistbreaker Helm",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 1532,
    "description": "Martial melee weapon dealing 1d8 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you deal acid, cold, or fire damage with an attack or spell, you can choose to impose an additional effect. If you deal acid damage, the target's AC is reduced by 1 until the end of your next turn. If you deal cold damage, the target's movement speed is reduced by 10 feet until the end of your next turn. If you deal fire damage, the target takes 1d4 fire damage at the start of its next turn. The flail You can use an action to expend the charge. For the next minute, your attacks with this weapon deal an extra 1d6 damage of your choice from acid, cold, or fire. This item requires attunement.",
    "descriptors": [],
    "name": "Flail of Ages (Flail)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1195,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. Your weapon attacks deal an extra 1d4 fire damage. Your unarmed strikes deal an extra 1d4 necrotic damage, and when you hit with an unarmed strike, the target begins bleeding, taking 1d4 slashing damage at the start of each of its turns. A creature can use an action to stanch the bleeding with a DC 12 Wisdom (Medicine) check. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1550,
    "description": "While wearing this helm, you gain a +2 bonus to saving throws against spells and a +1 bonus to Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Helmet",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 375,
    "description": "While wearing these gloves, when you take the Dash action or use a similar feature that increases your movement, you can jump without using a bonus action for the rest of that turn.",
    "descriptors": [],
    "name": "Fleetfingers",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 375,
    "description": "While wearing this cloak, when a creature within 5 feet of you hits you with a melee attack, that creature takes 1d4 acid damage.",
    "descriptors": [],
    "name": "Fleshmelter Cloak",
    "rarity": "Uncommon",
    "type": "Cloak"
  },
  {
    "cost": 1567,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Part the Flesh. Once on each of your turns when you hit a creature with this weapon, you can cause the attack to deal an extra 2d6 slashing damage. If you do, the target's AC is reduced by 1 until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Fleshrender (Shortsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 10150,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 bludgeoning damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. Your attacks with this weapon ignore resistance to bludgeoning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Foebreaker (Maul)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 420,
    "description": "While wearing it, you can use an action to cast ice knife (save DC 12). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Frost Prince",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 962,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You have advantage on attack rolls against monstrosities with this magic weapon.",
    "descriptors": [],
    "name": "Gandrel's Aspiration (Heavy Crossbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 642,
    "description": "While wearing this garment, when you use Patient Defense, you gain resistance to bludgeoning, piercing, and slashing damage until the start of your next turn. When you use Step of the Wind, your next attack roll before the end of your turn has advantage and deals an extra 1d8 force damage on a hit. This item requires attunement.",
    "descriptors": [],
    "name": "Garb of the Land and Sky",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 6302,
    "description": "While wearing these gloves, you gain a +1 bonus to spell save DC and your unarmed strikes deal an extra 1d4 force damage. The gloves have 3 charges and regain 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast command (save DC 16). This item requires attunement.",
    "descriptors": [],
    "name": "Gauntlet of the Tyrant",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 19660,
    "description": "Your Strength score is 23 while you wear these gauntlets. They have no effect if your Strength is already 23 or higher. You gain a +1 bonus to Strength saving throws while wearing these gauntlets. This item requires attunement.",
    "descriptors": [],
    "name": "Gauntlets of Hill Giant Strength",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 350,
    "description": "While wearing these gauntlets, when you use your Action Surge feature, you gain a 1d4 bonus to attack rolls for the rest of your turn. This item requires attunement.",
    "descriptors": [],
    "name": "Gauntlets of Surging Accuracy",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 11200,
    "description": "While wearing these gauntlets, you gain a +1 bonus to attack rolls with weapons. Creatures have disadvantage on saving throws against your maneuvers and weapon-based special attacks (such as Disarming Attack, Menacing Attack, or similar features). This item requires attunement.",
    "descriptors": [],
    "name": "Gauntlets of the Warmaster",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 3775,
    "description": "While wearing these gloves, when you cast a cantrip that targets only one creature, you can target a second creature within range with the same cantrip. You can't target the same creature twice. This item requires attunement.",
    "descriptors": [],
    "name": "Gemini Gloves",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 2685,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, it suffers disadvantage on attack rolls until the end of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Giantbreaker (Heavy Crossbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1135,
    "description": "While wearing this hat, at the start of combat, your walking speed increases by 5 feet for each point of your Charisma modifier (minimum of 5 feet) until the end of your first turn. You have advantage on Constitution saving throws to maintain concentration on spells. This item requires attunement.",
    "descriptors": [],
    "name": "Gibus of the Worshipful Servant",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 2502,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. Off-Hand. While wielding this weapon in your off hand, you gain a +1 bonus to AC. This item requires attunement.",
    "descriptors": [],
    "name": "Gleamdance Dagger (Dagger)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 480,
    "description": "While wielding this shield, you gain a +1 bonus to Dexterity (Stealth) checks in addition to the shield's normal bonus to AC.",
    "descriptors": [],
    "name": "Gloomstrand Shield",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 390,
    "description": "While wearing these gloves, you are proficient with longbows and shortbows, and your ranged weapon attacks deal an extra 2 damage.",
    "descriptors": [],
    "name": "Gloves of Archery",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 375,
    "description": "While wearing these gloves, when you deal damage to a creature with a weapon attack, that creature suffers a 1d4 penalty to its next saving throw against a spell you cast before the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Baneful Striking",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 995,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. When you inflict a condition on a creature with a weapon attack (such as grappled, prone, or frightened), your spell save DC increases by 1 until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Battlemage's Power",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1080,
    "description": "While wearing these gloves, when you deal thunder, lightning, or radiant damage to a creature, that creature becomes vulnerable to thunder damage until the end of your next turn (unless it has resistance or immunity to thunder damage). This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Belligerent Skies",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 607,
    "description": "While wearing these gloves, your unarmed strikes deal an extra 1d4 fire damage. In addition you can use an action to cast scorching ray. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Cinder and Sizzle",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 695,
    "description": "While wearing these gloves, you gain a +1 bonus to unarmed strike attack rolls, and your unarmed strikes deal an extra 2 bludgeoning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Crushing",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 11560,
    "description": "Your Dexterity score is 17 while you wear these gloves. They have no effect if your Dexterity is already 18 or higher. You gain a +1 bonus to attack rolls while wearing these gloves. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Dexterity",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 420,
    "description": "These gloves have 3 charges and regain 1d3 expended charges daily at dawn. While wearing these gloves, you can use a bonus action to expend 1 charge to cast hail of thorns.",
    "descriptors": [],
    "name": "Gloves of Hail of Thorns",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 620,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. When you use a Channel Divinity option from your Sacred Oath, you gain the benefit of the heroism spell for 1 minute (no concentration required). This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Heroism",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 395,
    "description": "While wearing these gloves, you gain a +1 bonus to Dexterity (Sleight of Hand) checks. When you deal damage to a creature with a melee weapon attack and you bear the Absolute's brand, that creature suffers a 1d4 penalty to its attack rolls and saving throws until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Power",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 37965,
    "description": "While wearing these gloves, your Constitution score increases by 2, to a maximum of 20, and your unarmed strikes deal an extra 1d10 force damage. Once per turn when you hit with an unarmed strike, you can choose one of the following benefits: regain 10 hit points, or forgo the healing to gain advantage on attack rolls and saving throws until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Soul Catching",
    "rarity": "Legendary",
    "type": "Gloves"
  },
  {
    "cost": 920,
    "description": "While wearing these gloves, you are considered a construct for the purpose of spells and effects. You have advantage on weapon attack rolls and resistance to lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of the Automaton",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 350,
    "description": "While wearing these gloves and dual wielding weapons, you can add your ability modifier to the damage of your off-hand weapon attacks. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of the Balanced Hands",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1400,
    "description": "While wearing these gloves and wielding a melee weapon in one hand with nothing in your other hand, you gain a +2 bonus to attack rolls with that weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of the Duellist",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 632,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. When you are within 5 feet of two or more hostile creatures, you have advantage on melee weapon attack rolls. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of the Growling Underdog",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 487,
    "description": "While wearing these gloves, you deal an extra 1d4 damage with thrown weapon attacks and attacks made with improvised weapons. This item requires attunement.",
    "descriptors": [],
    "name": "Gloves of Uninhibited Kushigo",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 494,
    "description": "While wielding this shield, when you have half your hit points or fewer, you can use a bonus action to gain 8 temporary hit points. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Glowing Shield",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 960,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While holding this staff, you can cast fire bolt at will. You use your spellcasting ability for the spell. This item requires attunement.",
    "descriptors": [],
    "name": "Gold Wyrmling Staff (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 38300,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. When you hit a creature with this weapon, the next attack roll against that creature before the end of your next turn has advantage. The bow You can use a bonus action to gain the effect of the haste spell for 1 minute. Once you use this property, you can\\'t use it again until the next dawn. This effect doesn't require concentration, and you don't suffer the lethargy effect when it ends. This item requires attunement.",
    "descriptors": [],
    "name": "Gontr Mael (Longbow)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 11965,
    "description": "While wearing this helm, attack rolls can't score a critical hit against you, and you have resistance to fire damage. In addition you can use a bonus action to cast hunter's mark. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Grymskull Helm",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 407,
    "description": "While wearing this ring, you can cast light at will.",
    "descriptors": [],
    "name": "Guiding Light",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 8500,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon, a +1 bonus to initiative rolls, and advantage on Wisdom (Perception) checks while this weapon is on your person. When you make an attack roll as a reaction, you have advantage on that attack roll. This item requires attunement.",
    "descriptors": [],
    "name": "Halberd of Vigilance (Halberd)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 375,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 bludgeoning damage. When you jump at least 10 feet and land within 10 feet of a creature, that creature must succeed on a DC 12 Dexterity saving throw or take 1d6 thunder damage.",
    "descriptors": [],
    "name": "Hamarhraft (Maul)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1657,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a fiend or undead with this weapon, the target takes an extra 1d6 bludgeoning damage. The hammer you can use an action to cast detect thoughts (save DC 14). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Hammer of the Just (Warhammer)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 430,
    "description": "While wearing this amulet, you can cast fog cloud at will.",
    "descriptors": [],
    "name": "Hammergrim Mist Amulet",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 9465,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. Your Strength score is 18 while you wield this magic mace. It has no effect if your Strength is already 18 or higher. This item requires attunement.",
    "descriptors": [],
    "name": "Handmaiden's Mace (Mace)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 4478,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The rapier has 3 charges and regains 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge to gain 2d8 temporary hit points that last for 1 minute. This item requires attunement.",
    "descriptors": [],
    "name": "Harmonic Dueller (Rapier)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2235,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While wielding this halberd, your Strength score increases by 2, to a maximum of 23. Curse. This halberd is cursed. While attuned to it, your Intelligence and Wisdom scores are each reduced by 1. This item requires attunement.",
    "descriptors": [],
    "name": "Harmonium Halberd (Halberd)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1425,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you deal damage to a creature with this weapon, it must succeed on a DC 14 Charisma saving throw or suffer a 1d4 penalty to attack rolls and saving throws for 2 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Harold (Heavy Crossbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1495,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The quarterstaff you can use a bonus action to cast spiritual weapon. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Harper Sacredstriker (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 562,
    "description": "While wearing this helm, at the start of combat, your walking speed increases by 10 feet for the first 3 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Haste Helm",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 375,
    "description": "While wearing this hat, when you deal fire damage with a spell or attack, your spell save DC increases by 1 for 2 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Hat of Fire Acuity",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 375,
    "description": "While wearing this hat, when you deal thunder damage with a spell or attack, your spell save DC increases by 1 until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Hat of Storm Scion's Power",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 350,
    "description": "While wearing this hat, when you roll a 1 or 2 on a damage die for a spell attack, you can reroll that die once and must use the new roll. This item requires attunement.",
    "descriptors": [],
    "name": "Hat of the Sharp Caster",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 575,
    "description": "While wearing this hat, when you deal damage with an unarmed strike, you gain a +1 bonus to your spell save DC until the end of your turn. This item requires attunement.",
    "descriptors": [],
    "name": "Hat of Uninhibited Kushigo",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 385,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. This weapon deals an extra 1d6 fire damage on a hit. This item requires attunement.",
    "descriptors": [],
    "name": "Hellbeard Halberd (Halberd)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2695,
    "description": "While wearing these boots, difficult terrain doesn't cost you extra movement, and you can't be forcibly moved or knocked prone by enemy spells or effects. The boots When you fail a saving throw, you can use your reaction to succeed instead. Once you use this property, you can\\'t use it again until the next dawn. Hellcrawler. The boots have 3 additional charges for this feature and regain 1d3 expended charges daily at dawn. As a bonus action, you can teleport up to 60 feet to an unoccupied space you can see, leaving flames in your wake. Once you use this property, you can\\'t use it again until the next dawn. Each creature within 5 feet of the space you left must succeed on a DC 16 Dexterity saving throw or take 2d8 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Boots",
    "rarity": "Very Rare",
    "type": "Boots"
  },
  {
    "cost": 9100,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws, a +1 bonus to spell attack rolls, and your spell save DC increases by 1. Your weapon attacks deal an extra 1d6 fire damage. Your unarmed strikes deal an extra 1d6 necrotic damage, and when you hit with an unarmed strike, the target begins bleeding, taking 1d4 slashing damage at the start of each of its turns. A creature can use an action to stanch the bleeding with a DC 14 Wisdom (Medicine) check. The gloves have 3 charges and regain 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. Three rays of fire shoot from your hand. Make a ranged spell attack for each ray (+8 to hit). On a hit, the target takes 2d6 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Gloves",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 20110,
    "description": "While wearing this helm, you have darkvision out to a range of 40 feet. You can see in magical darkness as if it were dim light. You are immune to being blinded, and attack rolls can't score a critical hit against you. You gain a +2 bonus to saving throws against spells. You deal an extra 2d8 damage to creatures that are on fire. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Helmet",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 11520,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. The crossbow You can use a bonus action to imbue your next shot. Once you use this property, you can\\'t use it again until the next dawn. The next time you hit a creature with this weapon before the end of your turn, the attack deals an extra 4d8 lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "Hellfire Engine Crossbow (Heavy Crossbow)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 10142,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you deal damage with this weapon, your next weapon attack before the end of your next turn deals an extra 1d4 fire damage. Hellflame Cleave. Once on each of your turns when you attack with this weapon, you can make a sweeping attack. Each creature within 5 feet of you takes fire damage equal to your Strength modifier (minimum of 1) and must succeed on a DC 16 Dexterity saving throw or take 2d6 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Hellfire Greataxe (Greataxe)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 17035,
    "description": "Martial ranged weapon with ammunition (range 30/120), light, and loading properties, dealing 1d6 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon while you are hidden or invisible, the target must succeed on a DC 16 Dexterity saving throw or catch fire, taking 1d6 fire damage at the start of each of its turns. A creature can use an action to extinguish the flames. The crossbow has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast scorching ray. This item requires attunement.",
    "descriptors": [],
    "name": "Hellfire Hand Crossbow (Hand Crossbow)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1247,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. While this bow is on your person, you gain a +3 bonus to initiative rolls and advantage on Wisdom (Perception) checks. Once on each of your turns when you hit a creature with this weapon, that creature must succeed on a DC 12 Dexterity saving throw or be outlined by faerie fire until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Hellrider Longbow (Longbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 620,
    "description": "While wearing these gauntlets, you gain a +1 bonus to Strength saving throws. When you restore hit points to a creature using a spell or feature, that creature gains resistance to bludgeoning, piercing, and slashing damage for 2 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Hellrider's Pride",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 50535,
    "description": "While wearing this helm, you regain 2 hit points at the start of each of your turns, gain a +1 bonus to saving throws, and are immune to being stunned. Attack rolls can't score a critical hit against you. This item requires attunement.",
    "descriptors": [],
    "name": "Helm of Balduran",
    "rarity": "Legendary",
    "type": "Headwear"
  },
  {
    "cost": 620,
    "description": "While wearing this helmet, you gain a +1 bonus to Dexterity saving throws. When you deal damage with a weapon attack, your spell save DC increases by 1 for 2 rounds. This item requires attunement.",
    "descriptors": [],
    "name": "Helmet of Arcane Acuity",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 620,
    "description": "While wearing this helmet, you gain proficiency in Wisdom saving throws. If you are already proficient in Wisdom saving throws, you instead gain a +1 bonus to Wisdom saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Helmet of Autonomy",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 15925,
    "description": "While wearing this helmet, you gain a +1 bonus to Dexterity saving throws. While you have half your hit points or fewer, you can take one additional bonus action on each of your turns. This item requires attunement.",
    "descriptors": [],
    "name": "Helmet of Grit",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 642,
    "description": "While wearing this helmet, you gain a +1 bonus to Constitution saving throws. When you use Divine Smite or a similar smiting feature and inflict a condition on a creature (such as by stunning them or knocking them prone), you gain temporary hit points equal to your Charisma modifier (minimum of 1). This item requires attunement.",
    "descriptors": [],
    "name": "Helmet of Smiting",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 722,
    "description": "While wearing these gloves, when you restore hit points to a poisoned creature, that creature is no longer poisoned.",
    "descriptors": [],
    "name": "Herbalist's Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 398,
    "description": "While wearing these boots, you can't be knocked prone while moving across icy or frozen surfaces.",
    "descriptors": [],
    "name": "Hoarfrost Boots",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 2332,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While holding this staff, creatures have disadvantage on saving throws against your necromancy spells.  In addition you can use an action to cast arms of Hadar. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Hollow's Staff (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 620,
    "description": "While wearing this helm, you gain a +1 bonus to Constitution saving throws. When a creature misses you with a melee attack, it must succeed on a DC 12 Dexterity saving throw or take 1d4 radiant damage. This item requires attunement.",
    "descriptors": [],
    "name": "Holy Lance Helm",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 7150,
    "description": "While wearing this hood, you gain a +2 bonus to spell save DC and spell attack rolls. This item requires attunement.",
    "descriptors": [],
    "name": "Hood of the Weave",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 5005,
    "description": "While wearing this helm and you don't have all your hit points, you deal an extra 2 necrotic damage with melee weapon attacks and unarmed strikes. You gain a +2 bonus to attack rolls against creatures that have taken damage since the start of your last turn. Curse. This helm is cursed. At the end of each of your turns, if you didn't deal damage to a creature on that turn, you take 1d4 necrotic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Horns of the Berserker",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 7195,
    "description": "While wearing these bracers, you gain a +1 bonus to Strength saving throws and can cast mage hand at will. The bracers have 3 charges and regain 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast telekinesis. This item requires attunement.",
    "descriptors": [],
    "name": "Hr'a'cknir Bracers",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 677,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. When you hit a creature with this magic dagger, it must succeed on a DC 12 Constitution saving throw or take 1d4 piercing damage at the start of each of its turns as the wound bleeds profusely. The creature can repeat the saving throw at the end of each of its turns, ending the effect on a success. Any creature can use an action to stanch the bleeding with a DC 12 Wisdom (Medicine) check. This item requires attunement.",
    "descriptors": [],
    "name": "Hunter's Dagger (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1302,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. You have advantage on attack rolls against monstrosities. The bow you can use a bonus action to cast hunter's mark. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Hunting Shortbow (Shortbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1235,
    "description": "While wearing this robe, you have resistance to cold damage. In addition you can use an action to cast armor of Agathys at 3rd level. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Icebite Robe",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 713,
    "description": "While wearing these gloves, when you deal acid damage to a creature, that creature is poisoned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Ichorous Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 15460,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell attack rolls while holding this staff. While holding this staff, you have resistance to fire damage and can cast fire bolt at will. The staff has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 3 charges to cast fireball (save DC 16). This item requires attunement.",
    "descriptors": [],
    "name": "Incandescent Staff (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1860,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, it takes an extra 3 poison damage and must succeed on a DC 14 Constitution saving throw or be poisoned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Infernal Mace (Mace)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 25025,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. Your spell save DC increases by 1 while wielding this weapon. You can use your spellcasting ability modifier instead of your Dexterity modifier for attack and damage rolls with this weapon. The rapier You can use an action to summon a cambion (use the statistics for a cambion). Once you use this property, you can\\'t use it again until the next dawn. The cambion appears in an unoccupied space within 60 feet of you, acts on its own initiative, and obeys your verbal commands. It remains for 1 hour, until it is reduced to 0 hit points, or until you dismiss it as an action. This item requires attunement.",
    "descriptors": [],
    "name": "Infernal Rapier (Rapier)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 4450,
    "description": "While wearing this robe, you have resistance to fire damage. In addition you can use an action to cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Infernal Robe",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 1856,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, it takes an extra 3 poison damage and must succeed on a DC 14 Constitution saving throw or be poisoned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Infernal Spear (Spear)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 713,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. When you reduce a creature to 0 hit points with this magic weapon or score a critical hit, each creature of your choice within 5 feet of you must succeed on a DC 12 Strength saving throw or be knocked prone. This item requires attunement.",
    "descriptors": [],
    "name": "Intransigent Warhammer (Warhammer)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 460,
    "description": "While wielding this shield and a weapon affected by shillelagh, when a creature within 5 feet hits you with a melee attack, that creature takes 1 piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Ironvine Shield",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 675,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. This magic weapon functions as a normal club but is made of ironwood.",
    "descriptors": [],
    "name": "Ironwood Club (Club)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1138,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. When you hit a creature with this magic weapon, it must succeed on a DC 12 Constitution saving throw or have disadvantage on Constitution saving throws until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Jagged Spear (Spear)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 4000,
    "description": "While wearing this hat, you have advantage on Charisma (Persuasion) and Charisma (Deception) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Jannath's Hat",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 4025,
    "description": "While wearing these gloves, you gain a +1 bonus to saving throws. When you become blinded, paralyzed, or poisoned, you automatically cast lesser restoration on yourself to end one of those conditions. Once you use this property, you can't use it again until you finish a long rest. This item requires attunement.",
    "descriptors": [],
    "name": "Jhannyl's Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1637,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Colossal Onslaught. Once on each of your turns when you attack with this weapon, you can make a powerful overhead strike. The attack deals an extra 2d6 slashing damage, and if the target is Large or smaller, it must succeed on a DC 14 Strength saving throw or be knocked prone. This item requires attunement.",
    "descriptors": [],
    "name": "Jorgoral's Greatsword (Greatsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 5335,
    "description": "While wielding this shield, you gain a +1 bonus to AC in addition to the shield's normal bonus, and you have advantage on Wisdom (Perception) checks. The shield has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. For the next minute, you are heavily obscured to creatures more than 5 feet away from you, as you are shrouded in magical darkness. This item requires attunement.",
    "descriptors": [],
    "name": "Justiciar's Greatshield",
    "rarity": "Rare",
    "type": "Shield"
  },
  {
    "cost": 21590,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you attack with advantage using this weapon, the target must succeed on a DC 16 Constitution saving throw or be blinded until the end of your next turn. The scimitar has 3 charges and regains 1d3 expended charges daily at dawn. You can use a bonus action to expend 1 charge to shroud yourself in shadow. Your next attack with this weapon before the end of your turn is made with advantage and deals an extra 2d6 necrotic damage on a hit. This item requires attunement.",
    "descriptors": [],
    "name": "Justiciar's Scimitar (Scimitar)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 700,
    "description": "While wearing this ring, you can use an action to cast dominate beast (save DC 14). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Keepsake Ring",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 1420,
    "description": "While wielding this shield, you gain a +1 bonus to spell save DC and spell attack rolls, and you have advantage on Dexterity saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Ketheric's Shield",
    "rarity": "Rare",
    "type": "Shield"
  },
  {
    "cost": 765,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. This magic warhammer is well-crafted but has no additional magical properties beyond being a magic weapon for purposes of overcoming resistance. This item requires attunement.",
    "descriptors": [],
    "name": "Ketheric's Warhammer (Warhammer)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 395,
    "description": "While wearing this circlet, you gain a +1 bonus to Intelligence (Nature) checks. Special. While wearing this circlet and standing before certain ancient stone doors, you can open magical passages or shortcuts that would otherwise remain hidden.",
    "descriptors": [],
    "name": "Key of the Ancients",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 11650,
    "description": "While wearing this amulet, your Wisdom score increases by 1, to a maximum of 20. In addition you can use an action to cast aid at 3rd level. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Khalid's Gift",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 4450,
    "description": "This ring While wearing this ring, when you reduce a creature to 0 hit points, you can expend the charge (no action required). If you do, your next attack roll before the end of your next turn is an automatic critical hit. This item requires attunement.",
    "descriptors": [],
    "name": "Killer's Sweetheart",
    "rarity": "Very Rare",
    "type": "Ring"
  },
  {
    "cost": 12110,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. You score a critical hit on a roll of 19 or 20. When you roll damage for an attack with this weapon and roll a 1 or 2 on any damage die, you can reroll that die and must use the new roll. You have advantage on attack rolls with this weapon against creatures that are lightly or heavily obscured. This item requires attunement.",
    "descriptors": [],
    "name": "Knife of the Undermountain King (Shortsword)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 485,
    "description": "While wearing these gloves, you gain a +1 bonus to Dexterity (Sleight of Hand) checks. In addition you can use an action to cast knock. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Knock Knuckle Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 407,
    "description": "While wearing this amulet, you can cast dancing lights at will.",
    "descriptors": [],
    "name": "Komira's Locket",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 700,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. When you hit a creature with this weapon, it must succeed on a DC 12 Constitution saving throw or catch fire, taking 1d4 fire damage at the start of each of its turns. A creature can use an action to extinguish the flames. This item requires attunement.",
    "descriptors": [],
    "name": "Kurwin's Cauteriser (Scimitar)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1390,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon.  This item has 3 charges and regains 1d2+1 expended charges daily at dawn. You can use an action to expend a charge to unleash a cutting wind. Each creature in a 15-foot cone must make a DC 14 Dexterity saving throw, taking 2d6 slashing damage on a failed save, or half as much damage on a successful one. This item requires attunement.",
    "descriptors": [],
    "name": "Larethian's Wrath (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1400,
    "description": "Simple ranged weapon with ammunition (range 80/320) and two-handed properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While you are in dim light or darkness, you gain a 1d4 bonus to ranged weapon attack rolls with this weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Least Expected (Shortbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 8650,
    "description": "While wearing these gauntlets, you gain a +1 bonus to Strength saving throws and a +2 bonus to attack and damage rolls with weapons. This item requires attunement.",
    "descriptors": [],
    "name": "Legacy of the Masters",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 713,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage.  You gain a +1 bonus to attack and damage rolls made with this magic weapon. You deal an addition 1d6 lightning damage with is weapon.  This magic halberd is designed for constructs. When a creature that is not a construct makes an attack with this weapon, it must succeed on a DC 12 Constitution saving throw or be stunned until the end of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Light of Creation (Halberd)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 704,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. When you hit a creature with this magic weapon, it must succeed on a DC 12 Constitution saving throw or be unable to take reactions until the start of its next turn. When you throw this weapon, it deals an extra 1d4 lightning damage on a hit. This item requires attunement.",
    "descriptors": [],
    "name": "Lightning Jabber (Spear)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 487,
    "description": "While wearing these boots, when you take the Dash action or use a similar feature that increases your movement, your melee weapon attacks deal an extra 1d4 damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Linebreaker Boots",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 917,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. While wielding this magic weapon, you have resistance to necrotic damage. When you hit a creature with this weapon, each creature within 5 feet of you (including you) takes 1d6 necrotic damage.",
    "descriptors": [],
    "name": "Loviatar's Scourge (Mace)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 648,
    "description": "While wearing these gloves, you gain a +1 bonus to Strength saving throws. Attacks you make deal an extra 1d4 radiant damage. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 1395,
    "description": "While wearing this ring, you gain a +1 bonus to Intelligence (Arcana) and Intelligence (Religion) checks.",
    "descriptors": [],
    "name": "Mage's Friend",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 4175,
    "description": "While wearing this cloak, you can use an action to cast crusader's mantle. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement",
    "descriptors": [],
    "name": "Mantle of the Holy Warrior",
    "rarity": "Very Rare",
    "type": "Cloak"
  },
  {
    "cost": 61312,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +3 bonus to spell save DC and spell attack rolls while holding this staff. The staff has 5 charges and regains 1d4+1 expended charges daily at dawn. You can use an action to expend charges to cast one of the following abilities: (1 charge) choose acid, cold, fire, lightning, or thunderyour spells of that damage type deal an extra 1d8 damage for 1 minute; (3 charges) as a bonus action, regain one expended spell slot of 3rd level or lower. This item requires attunement.",
    "descriptors": [],
    "name": "Markoheshkir (Quarterstaff)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 2395,
    "description": "While wearing this hat, you gain a +1 bonus to ranged attack rolls (including ranged weapon attacks and ranged spell attacks).",
    "descriptors": [],
    "name": "Marksmanship Hat",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 2642,
    "description": "These gloves have 3 charges and regain 1d2+1 expended charges daily at dawn. While wearing these gloves, when you make a weapon attack, you can expend 1 charge to gain advantage on the attack roll. If the attack hits, it deals an extra 1d8 damage. This item requires attunement.",
    "descriptors": [],
    "name": "Martial Exertion Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 16820,
    "description": "While wearing this mask, you gain a +2 bonus to attack rolls, initiative rolls, and Wisdom (Perception) checks. The mask has 3 charges and regains 1d2+1 expended charges daily at dawn. You can use an action to expend 1 charge to cast detect thoughts (save DC 16). This item requires attunement.",
    "descriptors": [],
    "name": "Mask of Soul Perception",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 2695,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell save DC and spell attack rolls while holding this staff. In addition you can use an action to cast Melf's acid arrow. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Melf's First Staff (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 875,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. This magic halberd is well-crafted but has no additional magical properties beyond being a magic weapon for purposes of overcoming resistance.",
    "descriptors": [],
    "name": "Merregon Halberd (Halberd)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 2532,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Your jump distance increases by 10 feet. When you hit a monstrosity with this weapon, the target takes an extra 1d4 slashing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Monster Slayer Glaive (Glaive)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 26664,
    "description": "While wearing this robe, you gain a +1 bonus to saving throws. When you succeed on a saving throw against a spell cast by a creature you can see, that creature takes 1d4 radiant damage. While wearing this robe, you can cast produce flame at will.  You can use an action to create a 10-foot-radius sphere of bright spectral moonlight centered on you for 1 minute. Once you use this property, you can\\'t use it again until the next dawn. The sphere moves with you.  As a bonus action, a creature of your choice within the sphere gains 1d8 temporary hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Moon Devotion Robe",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 1375,
    "description": "While wearing this amulet and you have half your hit points or fewer, you don't provoke opportunity attacks. This item requires attunement.",
    "descriptors": [],
    "name": "Moondrop Pendant",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 3395,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. This item requires attunement.",
    "descriptors": [],
    "name": "Moonlight Glaive (Glaive)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 8310,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage.  You deal an additional 1d6 cold damage with this weapon. While holding this staff, you can cast ray of frost at will. When you deal cold damage with a spell or this weapon, you deal an extra 1 cold damage. When you deal cold damage to a creature, its movement speed is reduced by 10 feet until the end of its next turn (this effect doesn't stack with multiple applications). This item requires attunement.",
    "descriptors": [],
    "name": "Mourning Frost (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1705,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. When you hit a creature that has half its hit points or fewer with this magic dagger, the target takes an extra 1d4 piercing damage.",
    "descriptors": [],
    "name": "Murderous Cut (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1704,
    "description": "Martial melee weapon dealing 1d8 bludgeoning damage. This weapon deals an extra 1d4 necrotic damage on a hit.",
    "descriptors": [],
    "name": "Myrkulite Scourge (Flail)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1430,
    "description": "While wearing these boots, you can cast feather fall at will.",
    "descriptors": [],
    "name": "Mystra's Grace",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 1743,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. When you hit a creature that is not a plant or beast with this magic weapon, it must succeed on a DC 12 Strength saving throw or be restrained by magical vines until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Nature's Snare (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 4705,
    "description": "Martial ranged weapon with ammunition (range 30/120), light, and loading properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The crossbow has 3 charges and regains 1d2+1 expended charges daily at dawn. You can use an action to expend 1 charge to cast magic missile at 1st level. This item requires attunement.",
    "descriptors": [],
    "name": "Ne'er Misser (Hand Crossbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 3375,
    "description": "While wearing this amulet, when you deal acid, cold, fire, lightning, or thunder damage with a cantrip, you add your spellcasting ability modifier to the damage dealt. This item requires attunement.",
    "descriptors": [],
    "name": "Necklace of Elemental Augmentation",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 4767,
    "description": "While wearing these gloves, you gain a +1 bonus to Dexterity (Sleight of Hand) checks. If you are a gnome, your Dexterity score increases by 2, to a maximum of 20. If you are a halfling or dwarf, your Dexterity score increases by 1, to a maximum of 20. This item requires attunement.",
    "descriptors": [],
    "name": "Nimblefinger Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 8175,
    "description": "While wearing this cloak, you can use an action to cast dominate person (save DC 16). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Nymph Cloak",
    "rarity": "Very Rare",
    "type": "Cloak"
  },
  {
    "cost": 62755,
    "description": "Martial melee weapon with thrown (range 60/120) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon.  When you throw this weapon, it returns to your hand immediately after the attack. You can't be disarmed of this weapon. Your walking speed and jump distance increase by 10 feet. You are immune to falling damage. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. When you throw this weapon and hit a target, each creature within 20 feet of the target must make a DC 18 Dexterity saving throw, taking 3d4 thunder damage on a failed save, or half as much damage on a successful one. This item requires attunement.",
    "descriptors": [],
    "name": "Nyrulna (Trident)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 5785,
    "description": "While wearing this robe, you have resistance to fire damage. When a creature succeeds on a saving throw against a spell you cast, that creature takes 1d4+4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Obsidian Laced Robe",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 59765,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 bludgeoning damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. While wielding this weapon, you have advantage on saving throws against spells.  The Warhammer has 3 charges and regains 1d2+1 expended charges daily at dawn. You can use an action to expend charges to activate the following effect.  When you hit a creature with this weapon, you can attempt to dispel magical effects. The target must make a DC 18 Charisma saving throw. On a failed save, you dispel one magical effect on the creature.   This item requires attunement.",
    "descriptors": [],
    "name": "Orphic Hammer (Warhammer)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 3650,
    "description": "While wearing this ring, you can use an action to cast confusion (save DC 16). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Orphic Ring",
    "rarity": "Very Rare",
    "type": "Ring"
  },
  {
    "cost": 2840,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While holding this staff, you are immune to being restrained by magical vines or plant-based effects. You can use an action to cast Grasping Vines (save DC 16). Once you use this property, you can\\'t use it again until the next dawn.  This item requires attunement.",
    "descriptors": [],
    "name": "Pale Oak (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 10775,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. You have advantage on attack rolls against undead creatures. This item requires attunement.",
    "descriptors": [],
    "name": "Pelorsun Blade (Rapier)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 6445,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While this weapon is on your person, you gain a +1 bonus to Charisma (Performance) checks. The sword has 6 charges and regains 1d6+1 expended charges daily at dawn. You can use an action to expend charges to activate one of the following effects: Shriek (3 charges). Each creature within 15 feet of you must make a DC 14 Constitution saving throw, taking 3d6 thunder damage on a failed save, or half as much damage on a successful one. Sing (3 charges). For 1 minute, you and allies within 30 feet of you deal an extra 1d4 damage with weapon attacks. This item requires attunement.",
    "descriptors": [],
    "name": "Phalar Aluve (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1800,
    "description": "While wearing these gloves, when you deal poison damage to a creature, it must succeed on a DC 14 Constitution saving throw or be poisoned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Poisoner's Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1403,
    "description": "While wearing this robe, when you cast a spell that deals poison damage, you deal an extra 2d4 poison damage. This item requires attunement.",
    "descriptors": [],
    "name": "Poisoner's Robe",
    "rarity": "Uncommon",
    "type": "Clothing"
  },
  {
    "cost": 12650,
    "description": "While wearing this robe, when you deal damage with a cantrip, you add your Charisma modifier to the damage dealt. At the start of each of your turns, you gain temporary hit points equal to your Charisma modifier (minimum of 1). This item requires attunement.",
    "descriptors": [],
    "name": "Potent Robe",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 2436,
    "description": "While wearing this amulet, when you cast magic missile, you create one additional dart. In addition you can use an action to cast magic missile. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Psychic Spark",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 1635,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. While you are poisoned or under the effects of alcohol, you have advantage on attack rolls with this weapon, and when you hit with this weapon, each creature within 10 feet of the target takes 1d4 thunder damage. This item requires attunement.",
    "descriptors": [],
    "name": "Punch-Drunk Bastard (Greatclub)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 13225,
    "description": "While wearing this hat, when you deal fire damage with a spell of 1st level or higher, you catch fire taking 1d6 fire damage at the start of each of your turns until you or another creature uses an action to put out the flames.  While on fire you gain an additional bonus action. This item requires attunement.",
    "descriptors": [],
    "name": "Pyroquickness Hat",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 26500,
    "description": "While wearing these gloves, you can cast a cantrip that normally requires an action as a bonus action instead. This item requires attunement.",
    "descriptors": [],
    "name": "Quickspell Gloves",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 1988,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. The quarterstaff has 3 charges and regains 1d2+1 expended charges daily at dawn. You can use an action to expend 1 charge to cast create or destroy water (create water only). This item requires attunement.",
    "descriptors": [],
    "name": "Rain Dancer (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1185,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. You have advantage on attack rolls against beasts with this weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Rat Bat (Greatclub)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1530,
    "description": "While wearing these gloves, you can use an action to summon a spectral raven (use raven statistics) that appears in an unoccupied space within 30 feet of you. Once you use this property, you can\\'t use it again until the next dawn. It obeys any verbal commands that you issue to them (no action required by you) and takes its turn immediatly following you in initiative. It disappears after 1 hour or when reduced to 0 hit points.",
    "descriptors": [],
    "name": "Raven Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 3565,
    "description": "Martial melee weapon dealing 1d8 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. The morningstar has 3 charges and regains 1d2+1 expended charges daily at dawn. When an ally you can see hits with an attack, you can use your reaction and expend 1 charge to direct them. That ally adds 1d8 to the damage roll. This item requires attunement.",
    "descriptors": [],
    "name": "Ravengard's Scourger (Morningstar)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1418,
    "description": "While wearing these gloves, when your rage ends, you gain 15 temporary hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Reason's Grasp",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 1740,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. When you attack with advantage using this magic weapon and hit, the target takes an extra 1d8 psychic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Render of Mind and Body (Shortsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1680,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 piercing damage. This magic weapon has the thrown property with a normal range of 20 feet and a long range of 60 feet. When you throw this weapon, it returns to your hand immediately after the attack.",
    "descriptors": [],
    "name": "Returning Pike (Pike)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 600,
    "description": "While wearing it, you are constantly drenched, giving you resistance to fire damage but vulnerability to lightning and cold damage.",
    "descriptors": [],
    "name": "Reverse Rain Cloak",
    "rarity": "Uncommon",
    "type": "Cloak"
  },
  {
    "cost": 9687,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you reduce a creature to 0 hit points with any attack with this weapon, this item gains 1 charge (maximum 3 charges). While it has charges, it gains a +1 bonus to attack and damage rolls. All charges are lost when combat ends. This item requires attunement.",
    "descriptors": [],
    "name": "Rhapsody (Dagger)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1788,
    "description": "This ring has 3 charges and regains 1d3 expended charges daily at dawn. While wearing this ring, you can use an action to expend 1 charge to cast thunderwave (save DC 12).  This item requires attunement",
    "descriptors": [],
    "name": "Ring of Absolute Force",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 3500,
    "description": "While wearing this ring, when you deal damage with a cantrip, your spell save DC increases by 1 until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Arcane Synergy",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 2500,
    "description": "While wearing this ring, you can use an action to cast blink. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Ring of Blink",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 1420,
    "description": "While wearing this ring, you can use an action to cast color spray (save DC 12). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Ring of Colour Spray",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 903,
    "description": "While wearing this ring, when you deal acid, cold, fire, lightning, or thunder damage with a spell or cantrip, your next weapon attack before the end of your next turn deals an extra 1d4 damage of that type. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Elemental Infusion",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 5690,
    "description": "This ring has 2 charges and regains 1d2 expended charges daily at dawn. While wearing this ring, you can expend charges to cast the following spells: Ghoulish Touch (1 charge). As an action, make a melee spell attack (+6 to hit) against one creature within 5 feet. On a hit, the target takes 2d8 necrotic damage and is paralyzed until the end of your next turn. Exhort the Risen (2 charges). As a bonus action, you can command all undead creatures within 30 feet of you to move up to their speed and make one melee attack. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Exalted Marrow",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 4900,
    "description": "While wearing this ring, whenever you cast a spell of 1st level or higher, you automatically trigger a Wild Magic Surge.",
    "descriptors": [],
    "name": "Ring of Feywild Sparks",
    "rarity": "Very Rare",
    "type": "Ring"
  },
  {
    "cost": 875,
    "description": "While wearing this ring, you gain a 1d4 bonus to damage rolls with thrown weapons.",
    "descriptors": [],
    "name": "Ring of Flinging",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 895,
    "description": "While wearing this ring, you gain a +1 bonus to Charisma (Persuasion) and Charisma (Deception) checks.",
    "descriptors": [],
    "name": "Ring of Geniality",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1387,
    "description": "While wearing this ring, when a creature fails a saving throw against one of your spells or features, that creature has disadvantage on its next attack roll or ability check before the end of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Mental Inhibition",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 885,
    "description": "While wearing this ring, when you restore hit points to another creature, that creature is pulled up to 10 feet toward you.  Movement this way does not trigger opportunity attacks",
    "descriptors": [],
    "name": "Ring of Restorative Gravity",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 2401,
    "description": "While wearing this ring, when you restore hit points to another creature, you regain 2 hit points.",
    "descriptors": [],
    "name": "Ring of Salving",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1693,
    "description": "This ring has 3 charges and regains 1d3 expended charges daily at dawn. While wearing this ring, you can use a bonus action to expend 1 charge to set yourself on fire, until you or another creature uses an action to put out the flames. You take 1d6 fire damage at the start of each of your turns while on fire.  While you are on fire your weapon attacks deal an extra 2d6 fire damage. ",
    "descriptors": [],
    "name": "Ring of Self Immolation",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 2465,
    "description": "While wearing this ring, you can use an action to cast pass without trace. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Ring of Shadows",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1713,
    "description": "While wearing this ring, when you deal thunder damage to a creature that isn't resistant to thunder damage, that creature must succeed on a DC 12 Constitution saving throw or be stunned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Spiteful Thunder",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 2850,
    "description": "While wearing this ring, you have advantage on Wisdom (Insight) checks.",
    "descriptors": [],
    "name": "Ring of Truthfulness",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 2700,
    "description": "While wearing this ring and you are in dim light or darkness, you gain a +1 bonus to AC. This item requires attunement.",
    "descriptors": [],
    "name": "Ring of Twilight",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 3720,
    "description": "While wearing this ring, you have advantage on attack rolls but disadvantage on saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Risky Ring",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 1680,
    "description": "Simple melee weapon with light and thrown (range 20/60) properties, dealing 1d6 slashing damage. When you hit a creature with this magic weapon, it must succeed on a DC 12 Wisdom saving throw or suffer a 1d4 penalty to attack rolls and saving throws until the end of your next turn. Curse. If you have more than 50% of your hit points remaining when you hit a creature with this weapon, you take 1d6 piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Ritual Axe (Handaxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1677,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage.  As a bonus action, you can take 1d4 slashing damage to gain a 1d4 bonus to attack rolls and saving throws until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Ritual Dagger (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 677,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. This magic dagger is consecrated to Shar but has no additional mechanical benefits beyond being a magic weapon.",
    "descriptors": [],
    "name": "Ritual Dagger of Shar (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 5300,
    "description": "While wearing this robe, your spell save DC increases by 1. This item requires attunement.",
    "descriptors": [],
    "name": "Robe of Exquisite Focus",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 12500,
    "description": "While wearing this robe and concentrating on a spell, you gain a +1 bonus to AC and add your spellcasting ability modifier to your saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Robe of Supreme Defences",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 16736,
    "description": "While wearing this robe, you gain a +1 bonus to spell save DC and spell attack rolls. When you succeed on a saving throw against a spell, you regain 1d6 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Robe of the Weave",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 1736,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. Once on each of your turns when you hit a creature with this weapon, you can cause the wound to bleed profusely. The target takes an extra 1d6 slashing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Rupturing Blade (Rapier)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1950,
    "description": "While wielding this shield, you gain a +1 bonus to saving throws in addition to the shield's normal bonus to AC.",
    "descriptors": [],
    "name": "Safeguard Shield",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 28080,
    "description": "While wearing this helm, you gain a +1 bonus to Constitution saving throws. You have darkvision out to a range of 50 feet. If you already have darkvision, its range increases by 10 feet. The number you need to roll for a critical hit with weapon attacks is reduced by 1 (this effect stacks with similar effects). You are immune to being frightened and can't be affected by other emotion-altering conditions (such as charm person or fear). This item requires attunement.",
    "descriptors": [],
    "name": "Sarevok's Horned Helmet",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 970,
    "description": "While wearing this circlet and you are within 5 feet of two or more hostile creatures, you deal an extra 2 damage with weapon attacks and unarmed strikes. This item requires attunement.",
    "descriptors": [],
    "name": "Scabby Pugilist Circlet",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 920,
    "description": "While wearing this ring, you gain a +1 bonus to Charisma saving throws but suffer a -1 penalty to Wisdom saving throws.",
    "descriptors": [],
    "name": "Seemingly Gleaming Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 215301,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. While wielding this spear, you have advantage on Wisdom saving throws and Wisdom (Perception) checks. You have darkvision out to a range of 40 feet. If you already have darkvision, its range increases by 40 feet. The spear has 3 charges and regains 1d3 expended charges daily at dawn. You can expend charges to cast the following spells: moonbeam (1 charge, save DC 18), or as an action, you can expend 2 charges to create three motes of moonlight that orbit you for 1 minute. When a creature you can see within 30 feet makes an attack roll, you can use your reaction to expend one mote to grant advantage or impose disadvantage on that roll. This item requires attunement.",
    "descriptors": [],
    "name": "Selne's Spear of Night (Spear)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 3250,
    "description": "This amulet has 5 charges and regains 1d4+1 expended charges daily at dawn. While wearing this amulet, you can expend charges to cast the following spells: shatter (2 charges, save DC 16), or as a bonus action, you can expend 5 charges to regain one expended use of your Ki feature. Curse. This amulet houses a trapped sentient being. The DM determines the risks and consequences of using this item. This item requires attunement.",
    "descriptors": [],
    "name": "Sentient Amulet (Very Rare)",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 2487,
    "description": "While wearing these gloves, your unarmed strikes deal an extra 1d4 radiant damage. In addition you can use an action to cast guiding bolt. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Seraphic Pugilist Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1667,
    "description": "While wearing these gloves, your unarmed strikes deal an extra 1d4 force damage. In addition you can use an action to cast fear (save DC 14). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Servitor of the Black Hand Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 14830,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. The greataxe has 2 charges and regains 1d2 expended charges daily at dawn. You can expend charges to activate the following effects: Spiritual Greataxe (1 charge). As a bonus action, you summon a spectral greataxe that hovers near you for 1 minute. As a bonus action on subsequent turns, you can move the axe up to 20 feet and make one melee spell attack (+8 to hit) against a creature within 5 feet of it. On a hit, the target takes 1d8+4 force damage. Reduce (2 charges). As an action, target one creature within 30 feet. The target must succeed on a DC 16 Constitution saving throw or be reduced in size (as the enlarge/reduce spell, reduce only) for 1 minute. This item requires attunement.",
    "descriptors": [],
    "name": "Sethan (Greataxe)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 15050,
    "description": "While wearing this cloak and you are hidden, the number you need to roll for a critical hit with weapon attacks is reduced by 1 (this effect stacks with similar effects). This item requires attunement.",
    "descriptors": [],
    "name": "Shade-Slayer Cloak",
    "rarity": "Very Rare",
    "type": "Cloak"
  },
  {
    "cost": 1968,
    "description": "This ring has 3 charges and regains 1d2+1 expended charges daily at dawn. While wearing this ring, you can use a bonus action to expend 1 charge to cast shadow blade.",
    "descriptors": [],
    "name": "Shadow Blade Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 5555,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. You can use an action to summon a wraith bound to the lantern. Once you use this property, you can\\'t use it again until the next dawn. The wraith appears in an unoccupied space within 10 feet of you, acts on its own initiative, obeys your verbal commands, and can't be turned. It remains for 1 minute, until it is reduced to 0 hit points, or until you dismiss it as an action. This item requires attunement.",
    "descriptors": [],
    "name": "Shadow Lantern (Club)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1440,
    "description": "While wearing this hood, you can use an action to become invisible until the end of your next turn or until you make an attack or cast a spell. Once you use this property, you can\\'t use it again until you take a short or long rest. This item requires attunement.",
    "descriptors": [],
    "name": "Shadow of Menzoberranzan",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 1403,
    "description": "While wearing this ring, you deal an extra 1d4 force damage with weapon and unarmed attacks against creatures that are lightly or heavily obscured, or creatures who are incorporial.",
    "descriptors": [],
    "name": "Shadow-Cloaked Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 7775,
    "description": "While wearing this hat, you gain one additional use of your Wild Shape feature. This item requires attunement.",
    "descriptors": [],
    "name": "Shapeshifter Hat",
    "rarity": "Very Rare",
    "type": "Headwear"
  },
  {
    "cost": 1375,
    "description": "While wearing this ring and you are under the effect of a polymorph spell, Wild Shape, or disguise self, you gain a 1d4 bonus to all ability checks.",
    "descriptors": [],
    "name": "Shapeshifter's Boon Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 80801,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. While wielding this spear, you have advantage on saving throws while you are in dim light or darkness, and you are immune to being blinded. You deal an extra 1d6 damage with this weapon to creatures that are lightly or heavily obscured. The spear has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast darkness. This item requires attunement.",
    "descriptors": [],
    "name": "Shar's Spear of Evening (Spear)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 1788,
    "description": "This amulet has 3 charges and regains 1d2+1 expended charges daily at dawn. While wearing this amulet, you can use an action to expend 1 charge to cast charm person (save DC 12).  This item requires attunement",
    "descriptors": [],
    "name": "Shar's Temptation",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 3246,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, you regain 1d6 hit points. Curse. This weapon is cursed. While in Combat, at the end of each of your turns, if you didn't hit a creature with this weapon on that turn, you must succeed on a DC 14 Wisdom saving throw or use your action on your next turn to make one melee attack against a random creature within reach. This item requires attunement.",
    "descriptors": [],
    "name": "Shattered Flail (Mace)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 5205,
    "description": "While wearing this garment, you have advantage on saving throws against spells. In addition you can use an action to cast mirror image. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Shelter of Athkatla",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 14510,
    "description": "While wielding this shield, you gain a +2 bonus to AC in addition to the shield's normal bonus. This item requires attunement.",
    "descriptors": [],
    "name": "Shield (Hope)",
    "rarity": "Very Rare",
    "type": "Shield"
  },
  {
    "cost": 22910,
    "description": "While wielding this shield, you gain a +1 bonus to AC in addition to the shield's normal bonus, and you gain one additional 1st-level spell slot. When a creature hits you with a melee attack, you can use your reaction to force the attacker to make a DC 16 Dexterity saving throw. On a failed save, the attacker is knocked prone. You can use an action to cast aid at 3rd level. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Shield of Devotion",
    "rarity": "Very Rare",
    "type": "Shield"
  },
  {
    "cost": 2605,
    "description": "While wielding this shield, you have resistance to fire damage.  The shield has 3 charges and regains 1d4 expended charges daily at dawn. When a creature within 5 feet hits you with a melee attack, you can use your reaction to expend 1 charge. The attacker takes 2d8 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Shield of Scorching Reprisal",
    "rarity": "Rare",
    "type": "Shield"
  },
  {
    "cost": 2250,
    "description": "This shield has 2 charges and regains 1d2 expended charges daily at dawn.  While wielding this shield, you can use a reaction to expend a charge when you are hit by an attack to cast shield. This item requires attunement.",
    "descriptors": [],
    "name": "Shield of Shielding",
    "rarity": "Rare",
    "type": "Shield"
  },
  {
    "cost": 27930,
    "description": "While wielding this shield, you gain a +1 bonus to AC in addition to the shield's normal bonus, and you gain one additional 1st-level spell slot. Creatures have disadvantage on saving throws against your spells and effects that would frighten them. When a creature hits you with a melee attack, you can use your reaction to force the attacker to make a DC 16 Dexterity saving throw. On a failed save, the attacker is knocked prone. This item requires attunement.",
    "descriptors": [],
    "name": "Shield of the Undevout",
    "rarity": "Very Rare",
    "type": "Shield"
  },
  {
    "cost": 2650,
    "description": "This ring has 2 charges and regains 1d2 expended charges daily at dawn. While wearing this ring, you can expend charges to cast the following spells: invisibility (1 charge), blur (1 charge). This item requires attunement.",
    "descriptors": [],
    "name": "Shifting Corpus Ring",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 677,
    "description": "Simple melee weapon with light and thrown (range 20/60) properties, dealing 1d4 bludgeoning damage. This weapon sheds bright light in a 15-foot radius and dim light for an additional 15 feet.",
    "descriptors": [],
    "name": "Shining Staver-of-Skulls (Light Hammer)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1728,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. When you hit a creature that has all its hit points with this magic weapon, the target takes an extra 1d8 piercing damage.",
    "descriptors": [],
    "name": "Shortsword of First Blood (Shortsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 707,
    "description": "While wearing this amulet, you can cast guidance at will.",
    "descriptors": [],
    "name": "Silver Pendant",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 46137,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. If you are a githyanki, you deal an extra 1d6 psychic damage with this weapon, have advantage on Intelligence, Wisdom, and Charisma saving throws, have resistance to psychic damage, and are immune to being charmed. This item requires attunement.",
    "descriptors": [],
    "name": "Silver Sword of the Astral Plane (Greatsword)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 3033,
    "description": "Simple melee weapon with light and thrown (range 20/60) properties, dealing 1d4 bludgeoning damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon.  Attacks you make deal an extra 1d6 fire damage.",
    "descriptors": [],
    "name": "Skybreaker (Light Hammer)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1895,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. When you attack with advantage using this weapon and hit, you deal an additional 1d4 slashing damage.  This item requires attunement.",
    "descriptors": [],
    "name": "Slicing Shortsword (Shortsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2037,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity saving throws. When you throw your boots (improvised weapon), they deal an extra 2d4 psychic damage and return to your feet immediately after the attack. This item requires attunement.",
    "descriptors": [],
    "name": "Slinging Shoes",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 815,
    "description": "While wearing this ring, you gain a +2 bonus to Dexterity (Stealth) and Dexterity (Sleight of Hand) checks, but you suffer a -1 penalty to Charisma ability checks and saving throws.",
    "descriptors": [],
    "name": "Smuggler's Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1547,
    "description": "While wearing these gloves, your unarmed strikes deal an extra 1d4 cold damage.  In addition you can use an action to cast ice knife (save DC 14). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Snow-Dusted Monastery Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1375,
    "description": "While wearing this ring, when you deal cold damage to a creature, the ground in a 15-foot radius around that creature becomes covered in ice (difficult terrain) until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Snowburst Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 2860,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. Once on each of your turns when you hit a creature with this weapon, you can cause spectral chains to lash out. The target must succeed on a DC 14 Strength saving throw or be restrained until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Sorrow (Glaive)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2787,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. You gain a +2 bonus to initiative rolls while this weapon is on your person. If you are a githyanki, you deal an extra 1d4 psychic damage with this weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Soulbreaker Greatsword (Greatsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 4650,
    "description": "While wearing these boots, you can use an action to cast dimension door. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Spaceshunt Boots",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 1775,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. When you hit a creature with this weapon, your walking speed increases by 10 feet until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Speedy Reply (Scimitar)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 3287,
    "description": "While wearing this amulet, you gain one additional 2nd-level spell slot. This item requires attunement.",
    "descriptors": [],
    "name": "Spell Savant Amulet",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 6925,
    "description": "While wearing this amulet, you can use a bonus action to regain one expended spell slot up to level 5. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Spellcrux Amulet",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 5842,
    "description": "While wearing these gloves, when you make a spell attack roll, you can choose to take a -5 penalty to the attack roll. If the attack hits, you deal an extra 1d8 damage. This item requires attunement.",
    "descriptors": [],
    "name": "Spellmight Gloves",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 1485,
    "description": "While wearing these gloves, when you make a spell attack roll, you can expend sorcery points to gain advantage on the roll. Cantrips cost 1 sorcery point, and spells cost sorcery points equal to the spell's level. This item requires attunement.",
    "descriptors": [],
    "name": "Spellseeking Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 3205,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. When you score a critical hit with this weapon, you can regain one expended 1st-level spell slot (no action required).  This item requires attunement.",
    "descriptors": [],
    "name": "Spellthief (Longbow)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1443,
    "description": "While wearing these boots, you are immune to being restrained by webs or the web spell, and your movement isn't reduced by webbed surfaces.",
    "descriptors": [],
    "name": "Spiderstep Boots",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 2080,
    "description": "While wearing this amulet, when you deal damage with a ranged spell attack, the target becomes vulnerable to thunder damage until the end of your next turn (unless it has resistance or immunity to thunder damage). This item requires attunement.",
    "descriptors": [],
    "name": "Spineshudder Amulet",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 1450,
    "description": "While wearing these boots, when you take the Dash action or use a similar feature that increases your movement, your walking speed increases by 10 feet. This item requires attunement.",
    "descriptors": [],
    "name": "Springstep Boots",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 1160,
    "description": "While wearing this ring and you have half your hit points or fewer, your walking speed increases by 10 feet. This item requires attunement.",
    "descriptors": [],
    "name": "Spurred Band",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1713,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While holding this staff, you can cast fire bolt at will. You may use your Intelligence, Wisdom, or Charisma ability for the spell.",
    "descriptors": [],
    "name": "Staff of a Mumbling Wizard (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 2750,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. While holding this staff, as an action you can cast a special version of bless called Mystra's Blessing. When you cast this version, targets gain a d4 bonus to weapon attack rolls and saving throws, and a 2d4 bonus to spell attack rolls.  Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Staff of Arcane Blessing (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 9770,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. Creatures have disadvantage on saving throws against your necromancy spells while you hold this staff. When you reduce a creature to 0 hit points with a spell while holding this staff, you gain 10 temporary hit points.  This item requires attunement.",
    "descriptors": [],
    "name": "Staff of Cherished Necromancy (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1988,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. The staff has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast ray of sickness (save DC 12). This item requires attunement.",
    "descriptors": [],
    "name": "Staff of Crones (Quarterstaff)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 5155,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell save DC and spell attack rolls while holding this staff. You can use your reaction to cast counterspell. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Staff of Interruption (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 6692,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell save DC and spell attack rolls while holding this staff.  You can use an action to grant yourself temporary bonus damage. For the next minute, when you cast a spell that deals acid, cold, fire, lightning, or thunder damage, you deal an extra 1d8 damage of that type. Once you use this property, you can\\'t use it again until the next dawn.  This item requires attunement.",
    "descriptors": [],
    "name": "Staff of Spellpower (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 5425,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell save DC and spell attack rolls while holding this staff. When a creature succeeds on a saving throw against a spell you cast while holding this staff, that creature must make a DC 14 Intelligence saving throw or be stunned until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Staff of the Emperor (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 9625,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage.  This item has 7 charges and regains 1d6+1 charges at dawn. You gain a +2 bonus to attack and damage rolls made with this magic weapon. Once on each of your turns when you hit a creature with this weapon, you can expend a charge and push the target up to 10 feet away from you. If the target is Medium or smaller, it must also succeed on a DC 16 Constitution saving throw or be stunned until the end of your next turn. This effect has no impact on dragons or Huge or larger creatures. This item requires attunement.",
    "descriptors": [],
    "name": "Staff of the Ram (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 2912,
    "description": "While wearing these gloves, you gain a +1 bonus to initiative rolls. When you deal Sneak Attack damage while wearing these gloves, you deal an extra 1d4 force damage. This item requires attunement.",
    "descriptors": [],
    "name": "Stalker Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 685,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. This magic shortsword is well-crafted but has no additional magical properties beyond being a magic weapon for purposes of overcoming resistance.",
    "descriptors": [],
    "name": "Steelforge Sword (Shortsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 2250,
    "description": "While wearing this helm, you are immune to being blinded.",
    "descriptors": [],
    "name": "Steelwatcher Helmet",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 3777,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. You can use an action to cast hold person (save DC 16). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Stillmaker (Dagger)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1403,
    "description": "While wearing this ring and concentrating on a spell, your weapon attacks deal an extra 1d4 psychic damage. This item requires attunement.",
    "descriptors": [],
    "name": "Strange Conduit Ring",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 1650,
    "description": "While wearing this amulet, you can use an action to cast Evard's black tentacles (save DC 14). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement",
    "descriptors": [],
    "name": "Strange Tendril Amulet",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 1220,
    "description": "While wearing this ring, you have darkvision out to a range of 60 feet.",
    "descriptors": [],
    "name": "Sunwalker's Gift",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 14350,
    "description": "While wearing this amulet, when you score a critical hit against a humanoid, they make a DC 14 Constitution save, on a failure they become Paralyzed. The target can repeat the saving throw (DC 14 Constitution) at the end of each of its turns, ending the effect on a success. This item requires attunement.",
    "descriptors": [],
    "name": "Surgeon's Subjugation Amulet",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 7752,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. When you hit a creature with this weapon, it must succeed on a DC 14 Constitution saving throw or be silenced until the end of your next turn. A silenced creature can't cast spells with verbal components or activate magic items that require command words. This item requires attunement.",
    "descriptors": [],
    "name": "Sussur Dagger (Dagger)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 7800,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. When you hit a creature with this weapon, it must succeed on a DC 14 Constitution saving throw or be silenced until the end of your next turn. A silenced creature can't cast spells with verbal components or activate magic items that require command words. This item requires attunement.",
    "descriptors": [],
    "name": "Sussur Greatsword (Greatsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 7751,
    "description": "Simple melee weapon with light property, dealing 1d4 slashing damage. When you hit a creature with this weapon, it must succeed on a DC 14 Constitution saving throw or be silenced until the end of your next turn. A silenced creature can't cast spells with verbal components or activate magic items that require command words. This item requires attunement.",
    "descriptors": [],
    "name": "Sussur Sickle (Sickle)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 3725,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. When you attack a creature with this weapon that has taken damage, you gain a 1d4 bonus to the attack roll. This item requires attunement.",
    "descriptors": [],
    "name": "Svartlebee's Woundseeker (Greatsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 4032,
    "description": "While wielding this shield, when a creature hits you with a melee attack, you can use your reaction to force the attacker to make a DC 16 Dexterity saving throw. On a failed save, the attacker is knocked prone. This item requires attunement.",
    "descriptors": [],
    "name": "Swires' Sledboard",
    "rarity": "Very Rare",
    "type": "Shield"
  },
  {
    "cost": 2725,
    "description": "While wearing these boots, you gain a +1 bonus to Dexterity (Acrobatics) checks and your jump distance increases by 5 feet.",
    "descriptors": [],
    "name": "Swiresy Shoes",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 10836,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, you regain 1d6 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Sword of Chaos (Greatsword)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 3042,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. Once on each of your turns when you hit a creature with this weapon, you can shroud yourself in shadow. Until the start of your next turn the next attack against you is done at disadvantage. This item requires attunement.",
    "descriptors": [],
    "name": "Sword of Clutching Umbra (Shortsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1815,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 2d6 slashing damage. The sword you can use a bonus action to cast shield of faith. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Sword of Justice (Greatsword)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 2700,
    "description": "Martial melee weapon with finesse property, dealing 1d8 piercing damage. Deals an additional 1d4 Psychic damage.  A blade of flawless craft. As it parts the air, you fancy you can hear a faint, whispering shriek...",
    "descriptors": [],
    "name": "Sword of Screams (Rapier)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 3202,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +1 bonus to attack and damage rolls made with it. You deal an extra 1d4 damage with this weapon against shapechangers and creatures under the effect of a polymorph spell. This item requires attunement.",
    "descriptors": [],
    "name": "Sword of the Emperor (Longsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 3575,
    "description": "While wearing these gloves, you are proficient with shortswords, longswords, and greatswords, and you gain a +1 bonus to melee attack rolls. This item requires attunement.",
    "descriptors": [],
    "name": "Swordmaster Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 2200,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. You can use your spellcasting ability modifier instead of your Dexterity modifier for attack and damage rolls with this weapon.",
    "descriptors": [],
    "name": "Sylvan Scimitar (Scimitar)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 875,
    "description": "While wearing this amulet, the DC for your death saving throws is reduced to 5 instead of 10.",
    "descriptors": [],
    "name": "Tarnished Charm",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 954,
    "description": "While wearing this amulet, you can use an action to cast speak with dead. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "The Amulet of Lost Voices",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 3385,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 piercing damage. This weapon only functions if it is your pact weapon as a warlock. You are always proficient with this weapon. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, it must succeed on a DC 14 Charisma saving throw or suffer the effects of the bane spell until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Baneful (Shortsword)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 97955,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. You gain a +3 bonus to attack and damage rolls made with this magic weapon. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. Fiends and undead standing in the light during combat must succeed on a DC 18 Constitution saving throw at the start of their turn or be blinded until the start of their next turn. The mace has 2 charges and regains 1d2 expended charges daily at dawn. When you are reduced to 0 hit points while holding this mace, you can expend 1 charge (no action required). If you do, you and each ally within 30 feet regains 1d6 hit points. You can also expend 1 charge to cast sunbeam (save DC 18). This item requires attunement.",
    "descriptors": [],
    "name": "The Blood of Lathander (Mace)",
    "rarity": "Legendary",
    "type": "Weapon"
  },
  {
    "cost": 8970,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon.  This item has 3 charges and recovers 1d4 charges at dawn.  As an action you may expend a charge and make a seperate attack against each creature within 5 feet. This item requires attunement.",
    "descriptors": [],
    "name": "The Dancing Breeze (Glaive)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 15750,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. The number you need to roll for a critical hit with this weapon is reduced by 1 (this effect stacks with similar effects). While making ranged attacks with this weapon without disadvantage, you double your proficiency bonus for the attack roll. This item requires attunement.",
    "descriptors": [],
    "name": "The Dead Shot (Longbow)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 6440,
    "description": "While wearing this cloak, once on each of your turns when you reduce a creature to 0 hit points, you can become invisible until the start of your next turn or until you make an attack or cast a spell. This item requires attunement.",
    "descriptors": [],
    "name": "The Deathstalker Mantle",
    "rarity": "Rare",
    "type": "Cloak"
  },
  {
    "cost": 1788,
    "description": "This amulet has 3 charges and regains 1d3 expended charges daily at dawn. While wearing this amulet, you can use an action to expend 1 charge to cast protection from evil and good.",
    "descriptors": [],
    "name": "The Ever-Seeing Eye",
    "rarity": "Uncommon",
    "type": "Amulet"
  },
  {
    "cost": 10282,
    "description": "While wearing this garment, your Dexterity score increases by 2, to a maximum of 20. You gain a +1 bonus to unarmed strike attack rolls and damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Graceful Cloth (Araj)",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 10622,
    "description": "While wearing this garment, your Dexterity score increases by 2, to a maximum of 20. You gain a +1 bonus to Dexterity saving throws, and your jump distance increases by 5 feet. This item requires attunement.",
    "descriptors": [],
    "name": "The Graceful Cloth (Esther)",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 3425,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you deal damage with this weapon, you deal an additional 1d4 lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Joltshooter (Longbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 4425,
    "description": "Martial ranged weapon with ammunition (range 100/400), heavy, loading, and two-handed properties, dealing 1d10 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. You gain a 1d4 bonus to attack and damage rolls with this weapon when attacking undead creatures. This item requires attunement.",
    "descriptors": [],
    "name": "The Long Arm of the Gur (Heavy Crossbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 11072,
    "description": "While wearing this garment, your Strength score increases by 2, to a maximum of 20. You are immune to being pushed by spells or effects, and you have advantage on saving throws against being restrained. This item requires attunement.",
    "descriptors": [],
    "name": "The Mighty Cloth",
    "rarity": "Rare",
    "type": "Clothing"
  },
  {
    "cost": 762,
    "description": "While wearing this hat, you add your Intelligence modifier to Charisma (Persuasion) checks. This item requires attunement.",
    "descriptors": [],
    "name": "The Pointy Hat",
    "rarity": "Rare",
    "type": "Headwear"
  },
  {
    "cost": 2460,
    "description": "This item has 3 charges and regains 1d4 charges at dawn.  While wielding this shield you can use an action to expend a charge and each creature within 10 feet of you takes 1d4 lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Real Sparky Sparkswall",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 7420,
    "description": "While wearing these gauntlets, you gain a +1 bonus to Strength saving throws. When you restore hit points to a creature, that creature gains resistance to bludgeoning, piercing, and slashing damage until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Reviving Hands",
    "rarity": "Very Rare",
    "type": "Gloves"
  },
  {
    "cost": 7512,
    "description": "Martial melee weapon dealing 1d8 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you hit an undead creature with this weapon, it must succeed on a DC 16 Wisdom saving throw or be turned for 1 minute. This item requires attunement.",
    "descriptors": [],
    "name": "The Sacred Star (Morningstar)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 2375,
    "description": "While wearing this circlet and you are in dim light or darkness, your spell save DC increases by 1. This item requires attunement.",
    "descriptors": [],
    "name": "The Shadespell Circlet",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 2411,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 slashing damage. When you hit a creature with this magic weapon, you deal an extra 1d6 force damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Skinburster (Halberd)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 1785,
    "description": "While wearing these gloves, when you hit a creature with an unarmed strike, you have advantage on attack rolls against creatures wearing metal armor or constructs made of metal. This item requires attunement.",
    "descriptors": [],
    "name": "The Sparkle Hands",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 5910,
    "description": "While wearing this ring, you are immune to being paralyzed by lightning effects and have resistance to lightning damage.",
    "descriptors": [],
    "name": "The Sparkswall",
    "rarity": "Uncommon",
    "type": "Ring"
  },
  {
    "cost": 3380,
    "description": "Martial melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. You deal an extra 1d6 lightning damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Sparky Points (Trident)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 4640,
    "description": "This amulet has 2 charges and regains 1d2 expended charges daily at dawn. While wearing this amulet, you can expend charges to activate the following effects: Ray of Fear (1 charge). As an action, you can target one creature within 60 feet. The target must succeed on a DC 16 Wisdom saving throw or be frightened of you for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on a success. Wounding Ray (1 charge). As an action, make a ranged spell attack (+8 to hit) against one creature within 60 feet. On a hit, the target takes 3d10 necrotic damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Spectator Eyes",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 2575,
    "description": "While wearing these boots, you gain a +1 bonus to Strength (Athletics) checks. When you take the Dash action your movement speed is doubled. This item requires attunement.",
    "descriptors": [],
    "name": "The Speedy Lightfeet",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 3975,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell attack rolls while holding this staff. When you deal lighting damage with a spell or cantrip while holding this staff, you deal an extra 1d6 damage. This item requires attunement.",
    "descriptors": [],
    "name": "The Spellsparkler (Quarterstaff)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 3731,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. This weapon deals an extra 1d6 radiant damage to undead.",
    "descriptors": [],
    "name": "The Undead Bane (Greataxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 988,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. When you miss a creature with an attack using this magic weapon, the next attack roll against that creature before the end of your next turn has advantage. This item requires attunement.",
    "descriptors": [],
    "name": "The Watcher's Guide (Spear)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 6375,
    "description": "While wearing this ring, when you restore hit points to a creature, that creature gains the benefit of the bless spell until the start of your next turn (no concentration required). This item requires attunement.",
    "descriptors": [],
    "name": "The Whispering Promise",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 2403,
    "description": "While wearing these gloves, when you deal fire damage, you deal an extra 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Thermoarcanic Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 2897,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. When you deal damage with this weapon you deal an extra 1d4 fire damage.",
    "descriptors": [],
    "name": "Thermodynamo Axe (Battleaxe)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 3947,
    "description": "Martial melee weapon with finesse and light properties, dealing 1d6 slashing damage. While concentrating on a spell, you deal an extra 1d4 poison damage with this weapon. You can use a bonus action to cast ensnaring strike. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Thorn Blade (Scimitar)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 1547,
    "description": "While wearing these gloves, your unarmed strikes deal an extra 1d4 thunder damage. You can use an action to cast thunderwave (save DC 14). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Thunderpalm Strikers",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 3700,
    "description": "While wearing this ring, you can use an action to cast beacon of hope. Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Til Death Do Us Part",
    "rarity": "Rare",
    "type": "Ring"
  },
  {
    "cost": 2800,
    "description": "Martial ranged weapon with ammunition (range 150/600), heavy, and two-handed properties, dealing 1d8 piercing damage. When you make a ranged attack with this weapon, you add your Strength modifier to the damage roll instead of your Dexterity modifier. This item requires attunement.",
    "descriptors": [],
    "name": "Titanstring Bow (Longbow)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 8950,
    "description": "Simple melee weapon dealing 1d4 bludgeoning damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. This weapon sheds bright light in a 20-foot radius and dim light for an additional 20 feet. This item requires attunement.",
    "descriptors": [],
    "name": "Torch of Revocation (Club)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 8955,
    "description": "Martial melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, the ground in a 10-foot radius around that creature becomes difficult terrain as it becomes flooded with water until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Trident of the Waves (Trident)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 1350,
    "description": "Martial melee weapon dealing 1d8 piercing damage. When you roll a 1 or 2 on a damage die for an attack with this weapon, you can reroll that die and must use the new roll.",
    "descriptors": [],
    "name": "Twist of Fortune (Morningstar)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 2395,
    "description": "While wearing these boots, you gain a +1 bonus to Charisma checks and Charisma saving throws.",
    "descriptors": [],
    "name": "Tyrannical Jackboots",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 1470,
    "description": "While wearing this amulet, you can use an action to cast detect thoughts (save DC 14). Once you use this property, you can\\'t use it again until the next dawn.",
    "descriptors": [],
    "name": "Uncovered Mysteries",
    "rarity": "Rare",
    "type": "Amulet"
  },
  {
    "cost": 21470,
    "description": "This amulet has 3 charges and regains 1d4 expended charges daily at dawn. While wearing this amulet, when an ally within 30 feet of you is targeted by an attack, you can use your reaction to expend 1 charge to cause that attack to automatically miss. This item requires attunement.",
    "descriptors": [],
    "name": "Unflinching Protector Amulet",
    "rarity": "Very Rare",
    "type": "Amulet"
  },
  {
    "cost": 975,
    "description": "While wearing these gloves, when you roll a 1 or 2 on a damage die for a spell attack, you can reroll that die once and must use the new roll. This item requires attunement.",
    "descriptors": [],
    "name": "Unlucky Thief's Gloves",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 5180,
    "description": "Martial melee weapon with heavy, reach, and two-handed properties, dealing 1d10 piercing damage. This weapon is invisible while you wield it. You can't be disarmed of this weapon, you have advantage on attack rolls with it, and you score a critical hit on a roll of 19 or 20. When you miss with an attack using this weapon, it becomes visible until the end of your next turn.",
    "descriptors": [],
    "name": "Unseen Menace (Pike)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 6075,
    "description": "While wearing these gauntlets, you gain a +1 bonus to attack rolls and a +1 bonus to Strength saving throws. This item requires attunement",
    "descriptors": [],
    "name": "Unwanted Masterwork Gauntlets",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 2575,
    "description": "While wearing these boots, you gain a +1 bonus to Strength (Athletics) checks.",
    "descriptors": [],
    "name": "Unwanted Masterwork Greaves",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 1317,
    "description": "While wearing these boots, you have resistance to acid damage.",
    "descriptors": [],
    "name": "Varsh Ko'kuu's Boots",
    "rarity": "Uncommon",
    "type": "Boots"
  },
  {
    "cost": 16475,
    "description": "While wearing this garment, undead creatures have disadvantage on attack rolls against you, and you have advantage on saving throws against their actions and spells.  This item requires attunement.",
    "descriptors": [],
    "name": "Veil of the Morning",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 705,
    "description": "Martial melee weapon with heavy and two-handed properties, dealing 1d12 slashing damage. Once on each of your turns when you hit a Large or larger creature with this weapon, you can make one additional melee weapon attack against a different creature within your reach.",
    "descriptors": [],
    "name": "Very Heavy Greataxe (Greataxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 4475,
    "description": "While wearing this vest, when you succeed on a saving throw against a spell, you regain 1d4 hit points. When a creature misses you with an attack, you can use your reaction to make one unarmed strike against that creature. This item requires attunement.",
    "descriptors": [],
    "name": "Vest of Soul Rejuvenation",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 76510,
    "description": "While wielding this shield, you gain a +2 bonus to AC in addition to the shield's normal bonus. You have advantage on saving throws against spells, and spell attack rolls against you have disadvantage. When a creature hits you with a melee attack, you can use your reaction to deal 2d4 force damage to the attacker and force it to make a DC 18 Dexterity saving throw. On a failed save, the attacker is knocked prone. The shield has 4 charges and regains 1d4 expended charges daily at dawn. You can expend charges to activate the following effects: Reflective Shell (3 charges). As an action, you create a magical barrier around yourself for 1 minute. Ranged spell attacks against you have disadvantage, and if a ranged spell attack misses you, the spell is reflected back at the caster. Warding Bond (1 charge). You can cast warding bond. This item requires attunement.",
    "descriptors": [],
    "name": "Viconia's Walking Fortress",
    "rarity": "Legendary",
    "type": "Shield"
  },
  {
    "cost": 2941,
    "description": "Simple melee weapon with thrown (range 20/60) and versatile (1d8) properties, dealing 1d6 piercing damage. When you hit a creature with this weapon, it must succeed on a DC 12 Dexterity saving throw or be blinded until the end of your next turn. You deal an extra 2d6 damage with this weapon to creatures that have multiple sets of eyes (such as beholders or spiders). This item requires attunement.",
    "descriptors": [],
    "name": "Vision of the Absolute (Spear)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 5990,
    "description": "While wearing these boots, you gain a +1 bonus to Strength (Athletics) checks. When you cast a spell that requires concentration, you gain 8 temporary hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Vital Conduit Boots",
    "rarity": "Rare",
    "type": "Boots"
  },
  {
    "cost": 3910,
    "description": "While wearing this cloak, when you cast a spell while you are within 5 feet of a hostile creature, you gain 7 temporary hit points.  Requires attunment",
    "descriptors": [],
    "name": "Vivacious Cloak",
    "rarity": "Rare",
    "type": "Cloak"
  },
  {
    "cost": 10277,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You gain a +2 bonus to attack and damage rolls made with this magic weapon. You gain a 1d4 bonus to attack and damage rolls with this weapon when attacking githyanki, aberrations, fiends, or elementals. The sword has 3 charges and regains 1d4 expended charges daily at dawn. You can use a bonus action to expend a charge and the next time you hit with this weapon before the end of your next turn, the attack deals an extra 1d6 psychic damage, and the target must succeed on a DC 16 Wisdom saving throw or be frightened of you for 1 minute. This item requires attunement.",
    "descriptors": [],
    "name": "Voss' Silver Sword (Longsword)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 2409,
    "description": "While wearing this circlet, when you restore hit points to another creature, you regain 1d6 hit points. This item requires attunement.",
    "descriptors": [],
    "name": "Wapira's Crown",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 3350,
    "description": "Your Intelligence score is 17 while you wear this headband. It has no effect if your Intelligence is already 17 or higher. This item requires attunement.",
    "descriptors": [],
    "name": "Warped Headband of Intellect",
    "rarity": "Uncommon",
    "type": "Headwear"
  },
  {
    "cost": 3950,
    "description": "While wearing this cloak, once on each of your turns, you gain resistance to the first instance of damage you take until you take damage (then the resistance ends). This item requires attunement.",
    "descriptors": [],
    "name": "Wavemother's Cloak",
    "rarity": "Rare",
    "type": "Cloak"
  },
  {
    "cost": 7837,
    "description": "While wearing this robe, you have resistance to fire and cold damage. The robe has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge to cast create or destroy water. This item requires attunement.",
    "descriptors": [],
    "name": "Wavemother's Robe",
    "rarity": "Very Rare",
    "type": "Clothing"
  },
  {
    "cost": 1186,
    "description": "Simple melee weapon with light property, dealing 1d4 slashing damage. You have advantage on attack rolls with this weapon against creatures that are wet or standing in water. This item requires attunement.",
    "descriptors": [],
    "name": "Wavemother's Sickle (Sickle)",
    "rarity": "Rare",
    "type": "Weapon"
  },
  {
    "cost": 4875,
    "description": "While wearing these gloves, you gain a +1 bonus to attack rolls and a +1 bonus to Dexterity (Sleight of Hand) checks.",
    "descriptors": [],
    "name": "Winkling Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 2075,
    "description": "While wearing these gloves, once per turn when you deal cold damage to a creature, its movement speed is reduced by 10 feet until the end of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Winter's Clutches",
    "rarity": "Uncommon",
    "type": "Gloves"
  },
  {
    "cost": 2922,
    "description": "Martial melee weapon with versatile (1d10) property, dealing 1d8 slashing damage. You have advantage on attack rolls with this weapon against creatures that are concentrating on a spell. This item requires attunement.",
    "descriptors": [],
    "name": "Witchbreaker (Battleaxe)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 19350,
    "description": "Simple melee weapon with versatile (1d8) property, dealing 1d6 bludgeoning damage. You gain a +1 bonus to spell save DC and spell attack rolls while holding this staff. When a creature fails a saving throw against one of your spells while you hold this staff, you regain 1d4 hit points. Using the staff you can use an action to cast blight (save DC 16). Once you use this property, you can\\'t use it again until the next dawn. Bound Weapon. This item requires attunement.",
    "descriptors": [],
    "name": "Woe (Quarterstaff)",
    "rarity": "Very Rare",
    "type": "Weapon"
  },
  {
    "cost": 6620,
    "description": "While wearing these gloves, you gain one additional use of your Bardic Inspiration feature. This item requires attunement.",
    "descriptors": [],
    "name": "Wondrous Gloves",
    "rarity": "Rare",
    "type": "Gloves"
  },
  {
    "cost": 1188,
    "description": "This shield has 3 charges and regains 1d3 expended charges daily at dawn. While wielding this shield, you can use a bonus action to expend 1 charge to make a melee weapon attack with the shield. On a hit, the target takes 1d6 bludgeoning damage and must succeed on a DC 12 Strength saving throw or be restrained by magical vines until the start of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Wood Woad Shield",
    "rarity": "Uncommon",
    "type": "Shield"
  },
  {
    "cost": 2384,
    "description": "Simple melee weapon with finesse and thrown (range 20/60) properties, dealing 1d4 piercing damage. While this dagger is on your person, goblins have disadvantage on attack rolls against you.",
    "descriptors": [],
    "name": "Worgfang (Dagger)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 5993,
    "description": "Simple melee weapon dealing 1d6 bludgeoning damage. This mace has 3 charges and regains 1d3 expended charges daily at dawn. When you miss a creature with an attack using this weapon, you can expend 1 charge (no action required) to automatically cast faerie fire (save DC 12) on the target. This item requires attunement.",
    "descriptors": [],
    "name": "Xyanyde (Mace)",
    "rarity": "Uncommon",
    "type": "Weapon"
  },
  {
    "cost": 11010,
    "description": "While wearing this armor, you gain a +2 bonus to AC. You can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Agility (Hide Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 12000,
    "description": "While wearing this armor, you gain a +2 bonus to AC. You can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Agility (Chain Shirt)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 13000,
    "description": "While wearing this armor, you gain a +2 bonus to AC. You can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Agility (Scale Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 15000,
    "description": "While wearing this armor, you gain a +2 bonus to AC. You can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Agility (Breastplate)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16000,
    "description": "While wearing this armor, you gain a +2 bonus to AC. You can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Agility (Half Plate)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 11900,
    "description": "While wearing this armor, you gain a +1 bonus to AC. Additionally, you gain one extra use of your Channel Divinity feature when you finish a long rest. This benefit is in addition to the use you would normally regain. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Devotion (Ring Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 11900,
    "description": "While wearing this armor, you gain a +1 bonus to AC. Additionally, you gain one extra use of your Channel Divinity feature when you finish a long rest. This benefit is in addition to the use you would normally regain. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Devotion (Chain Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 12100,
    "description": "While wearing this armor, you gain a +1 bonus to AC. Additionally, you gain one extra use of your Channel Divinity feature when you finish a long rest. This benefit is in addition to the use you would normally regain. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Devotion (Splint Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 13400,
    "description": "While wearing this armor, you gain a +1 bonus to AC. Additionally, you gain one extra use of your Channel Divinity feature when you finish a long rest. This benefit is in addition to the use you would normally regain. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Devotion (Plate Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 14725,
    "description": "While wearing this armor, you gain a +1 bonus to AC and your spell save DC increases by 1.  Once per short rest, the first time you step on a surface covered by plants or vines (natural or magical, such as those created by plant growth or entangle), you regain 1d4 hit points. As an action you can cast plant growth. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Landfall (Padded Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 14730,
    "description": "While wearing this armor, you gain a +1 bonus to AC and your spell save DC increases by 1.  Once per short rest, the first time you step on a surface covered by plants or vines (natural or magical, such as those created by plant growth or entangle), you regain 1d4 hit points. As an action you can cast plant growth. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Landfall (Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 14730,
    "description": "While wearing this armor, you gain a +1 bonus to AC and your spell save DC increases by 1.  Once per short rest, the first time you step on a surface covered by plants or vines (natural or magical, such as those created by plant growth or entangle), you regain 1d4 hit points. As an action you can cast plant growth. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Landfall (Studded Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16905,
    "description": "While wearing this armor, you gain a +2 bonus to AC and have advantage on saving throws against spells. These benefits persist when you use your Wild Shape feature. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Moonbasking (Padded Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16910,
    "description": "While wearing this armor, you gain a +2 bonus to AC and have advantage on saving throws against spells. These benefits persist when you use your Wild Shape feature. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Moonbasking (Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16910,
    "description": "While wearing this armor, you gain a +2 bonus to AC and have advantage on saving throws against spells. These benefits persist when you use your Wild Shape feature. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Moonbasking (Studded Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 13950,
    "description": "While wearing this armor, you gain a +1 bonus to AC and you have resistance to nonmagical bludgeoning, piercing, and slashing damage.  This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Persistence (Ring Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 14950,
    "description": "While wearing this armor, you gain a +1 bonus to AC and you have resistance to nonmagical bludgeoning, piercing, and slashing damage.  This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Persistence (Chain Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 15150,
    "description": "While wearing this armor, you gain a +1 bonus to AC and you have resistance to nonmagical bludgeoning, piercing, and slashing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Persistence (Splint Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16450,
    "description": "While wearing this armor, you gain a +1 bonus to AC and you have resistance to nonmagical bludgeoning, piercing, and slashing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Armor of Persistence (Plate Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 12950,
    "description": "While wearing this armor, your AC from this armor equals 16. You have advantage on Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Barkskin Armor (Hide Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 29980,
    "description": "While wearing this armor, you gain a +2 bonus to AC. Enemies within 5 feet of you become vulnerable to piercing damage from your attacks, unless they are already resistant or immune to piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Bhaalist Armor (Padded Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 29985,
    "description": "While wearing this armor, you gain a +2 bonus to AC. Enemies within 5 feet of you become vulnerable to piercing damage from your attacks, unless they are already resistant or immune to piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Bhaalist Armor (Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 29985,
    "description": "While wearing this armor, you gain a +2 bonus to AC. Enemies within 5 feet of you become vulnerable to piercing damage from your attacks, unless they are already resistant or immune to piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Bhaalist Armor (Studded Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 9700,
    "description": "While wearing this armor, you gain a +1 bonus to AC and have advantage on Wisdom saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Blackguard's Plate (Plate Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 4910,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +1 bonus to Dexterity (Stealth) checks.",
    "descriptors": [],
    "name": "Drow Studded Leather Armor (Studded Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 29720,
    "description": "While wearing this armor, your Constitution score increases by 2, to a maximum of 20. You gain a +1 bonus to Strength saving throws and Strength ability checks, and all piercing damage you take is reduced by 1 (minimum of 1 damage). This item requires attunement.",
    "descriptors": [],
    "name": "Dwarven Splintmail (Splint Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 29120,
    "description": "While wearing this armor, you gain a +2 bonus to AC, a +2 bonus to initiative rolls, and advantage on Dexterity (Stealth) checks. The armor has 3 charges and regains 1d3 expended charges daily at dawn. When you are hit by an attack, you can use your reaction to expend 1 charge to cast shield. This item requires attunement.",
    "descriptors": [],
    "name": "Elegant Studded Leather (Studded Leather Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 21700,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Emblazoned Plate of the Marshal (Plate Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 15610,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Flame Enamelled Armor (Hide Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 16600,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Flame Enamelled Armor (Chain Shirt)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 17600,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Flame Enamelled Armor (Scale Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 18600,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Flame Enamelled Armor (Breastplate)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 19600,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +2 bonus to initiative rolls and saving throws, and resistance to fire damage. As an action you may cast fire shield (warm version). Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Flame Enamelled Armor (Half Plate)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 6547,
    "description": "While wearing this armor, you gain a +1 bonus to AC. When a creature within 10 feet hits you with a melee attack, that creature takes 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Armor (Ring Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 7000,
    "description": "While wearing this armor, you gain a +1 bonus to AC. When a creature within 10 feet hits you with a melee attack, that creature takes 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Armor (Chain Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 7200,
    "description": "While wearing this armor, you gain a +1 bonus to AC. When a creature within 10 feet hits you with a melee attack, that creature takes 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Armor (Splint Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 7500,
    "description": "While wearing this armor, you gain a +1 bonus to AC. When a creature within 10 feet hits you with a melee attack, that creature takes 1d4 fire damage. This item requires attunement.",
    "descriptors": [],
    "name": "Flawed Helldusk Armor (Plate Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 1780,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity saving throws, Dexterity checks, and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Hedge Wanderer Armor (Hide Armor)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 1770,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity saving throws, Dexterity checks, and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Hedge Wanderer Armor (Chain Shirt)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 1770,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity saving throws, Dexterity checks, and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Hedge Wanderer Armor (Scale Mail)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 2170,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity saving throws, Dexterity checks, and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Hedge Wanderer Armor (Breastplate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 1770,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity saving throws, Dexterity checks, and Intelligence (Nature) checks.",
    "descriptors": [],
    "name": "Hedge Wanderer Armor (Half Plate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 48450,
    "description": "You are considered proficient with this armor while wearing it. While wearing this armor, you gain a +2 bonus to AC and resistance to fire damage.  When you succeed on a saving throw against a spell, the caster takes 1d6 fire damage. As an action you can cast Fly. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Armor (Ring Mail)",
    "rarity": "Legendary",
    "type": "Armor"
  },
  {
    "cost": 48450,
    "description": "You are considered proficient with this armor while wearing it. While wearing this armor, you gain a +2 bonus to AC and resistance to fire damage.  When you succeed on a saving throw against a spell, the caster takes 1d6 fire damage. As an action you can cast Fly. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Armor (Chain Mail)",
    "rarity": "Legendary",
    "type": "Armor"
  },
  {
    "cost": 48450,
    "description": "You are considered proficient with this armor while wearing it. While wearing this armor, you gain a +2 bonus to AC and resistance to fire damage.  When you succeed on a saving throw against a spell, the caster takes 1d6 fire damage. As an action you can cast Fly. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Armor (Splint Armor)",
    "rarity": "Legendary",
    "type": "Armor"
  },
  {
    "cost": 49950,
    "description": "You are considered proficient with this armor while wearing it. While wearing this armor, you gain a +2 bonus to AC and resistance to fire damage.  When you succeed on a saving throw against a spell, the caster takes 1d6 fire damage. As an action you can cast Fly. Once you use this property, you can\\'t use it again until the next dawn. This item requires attunement.",
    "descriptors": [],
    "name": "Helldusk Armor (Plate Armor)",
    "rarity": "Legendary",
    "type": "Armor"
  },
  {
    "cost": 2563,
    "description": "While wearing this armor, when you deal radiant damage to a creature, each hostile creature within 10 feet of that creature becomes vulnerable to radiant damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Armor (Hide Armor)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 3553,
    "description": "While wearing this armor, when you deal radiant damage to a creature, each hostile creature within 10 feet of that creature becomes vulnerable to radiant damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Armor (Chain Shirt)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 4153,
    "description": "While wearing this armor, when you deal radiant damage to a creature, each hostile creature within 10 feet of that creature becomes vulnerable to radiant damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Armor (Scale Mail)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 4853,
    "description": "While wearing this armor, when you deal radiant damage to a creature, each hostile creature within 10 feet of that creature becomes vulnerable to radiant damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Armor (Breastplate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 5530,
    "description": "While wearing this armor, when you deal radiant damage to a creature, each hostile creature within 10 feet of that creature becomes vulnerable to radiant damage until the end of your next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Luminous Armor (Half Plate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 4355,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +3 bonus to Dexterity (Stealth) checks while you are in dim light or darkness. This item requires attunement.",
    "descriptors": [],
    "name": "Penumbral Armor (Padded Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 4360,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +3 bonus to Dexterity (Stealth) checks while you are in dim light or darkness. This item requires attunement.",
    "descriptors": [],
    "name": "Penumbral Armor (Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 4360,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +3 bonus to Dexterity (Stealth) checks while you are in dim light or darkness. This item requires attunement.",
    "descriptors": [],
    "name": "Penumbral Armor (Studded Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 6262,
    "description": "While wearing this armor, you have resistance to necrotic damage.",
    "descriptors": [],
    "name": "Protective Plate (Plate Armor)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 3192,
    "description": "While wearing this armor, when you succeed on a saving throw against a spell, you regain 1d4 hit points. If you are a githyanki, you also have resistance to psychic damage while wearing this armor. This item requires attunement.",
    "descriptors": [],
    "name": "Psionic Ward Armor (Hide Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3282,
    "description": "While wearing this armor, when you succeed on a saving throw against a spell, you regain 1d4 hit points. If you are a githyanki, you also have resistance to psychic damage while wearing this armor. This item requires attunement.",
    "descriptors": [],
    "name": "Psionic Ward Armor (Chain Shirt)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3382,
    "description": "While wearing this armor, when you succeed on a saving throw against a spell, you regain 1d4 hit points. If you are a githyanki, you also have resistance to psychic damage while wearing this armor. This item requires attunement.",
    "descriptors": [],
    "name": "Psionic Ward Armor (Scale Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3482,
    "description": "While wearing this armor, when you succeed on a saving throw against a spell, you regain 1d4 hit points. If you are a githyanki, you also have resistance to psychic damage while wearing this armor. This item requires attunement.",
    "descriptors": [],
    "name": "Psionic Ward Armor (Breastplate)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3682,
    "description": "While wearing this armor, when you succeed on a saving throw against a spell, you regain 1d4 hit points. If you are a githyanki, you also have resistance to psychic damage while wearing this armor. This item requires attunement.",
    "descriptors": [],
    "name": "Psionic Ward Armor (Half Plate)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 21190,
    "description": "While wearing this armor, you gain a +1 bonus to AC and all damage you take is reduced by 2 (minimum of 1 damage). As a bonus action, you can activate the armor's power. While active, you can't be moved against your will by any spell or effect, but you have disadvantage on Dexterity saving throws. The effect lasts for 1 minute or until you end it as a bonus action. The armor has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. Each creature of your choice within 30 feet must make a DC 16 Wisdom saving throw. On a failed save, a creature takes 4d8 necrotic damage and is frightened of you for 1 minute. On a successful save, the creature takes half damage and isn't frightened. This item requires attunement.",
    "descriptors": [],
    "name": "Reaper's Embrace (Ring Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 21190,
    "description": "While wearing this armor, you gain a +1 bonus to AC and all damage you take is reduced by 2 (minimum of 1 damage). As a bonus action, you can activate the armor's power. While active, you can't be moved against your will by any spell or effect, but you have disadvantage on Dexterity saving throws. The effect lasts for 1 minute or until you end it as a bonus action. The armor has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. Each creature of your choice within 30 feet must make a DC 16 Wisdom saving throw. On a failed save, a creature takes 4d8 necrotic damage and is frightened of you for 1 minute. On a successful save, the creature takes half damage and isn't frightened. This item requires attunement.",
    "descriptors": [],
    "name": "Reaper's Embrace (Chain Mail)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 21390,
    "description": "While wearing this armor, you gain a +1 bonus to AC and all damage you take is reduced by 2 (minimum of 1 damage). As a bonus action, you can activate the armor's power. While active, you can't be moved against your will by any spell or effect, but you have disadvantage on Dexterity saving throws. The effect lasts for 1 minute or until you end it as a bonus action. The armor has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. Each creature of your choice within 30 feet must make a DC 16 Wisdom saving throw. On a failed save, a creature takes 4d8 necrotic damage and is frightened of you for 1 minute. On a successful save, the creature takes half damage and isn't frightened. This item requires attunement.",
    "descriptors": [],
    "name": "Reaper's Embrace (Splint Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 22690,
    "description": "While wearing this armor, you gain a +1 bonus to AC and all damage you take is reduced by 2 (minimum of 1 damage). As a bonus action, you can activate the armor's power. While active, you can't be moved against your will by any spell or effect, but you have disadvantage on Dexterity saving throws. The effect lasts for 1 minute or until you end it as a bonus action. The armor has 3 charges and regains 1d3 expended charges daily at dawn. You can use an action to expend 1 charge. Each creature of your choice within 30 feet must make a DC 16 Wisdom saving throw. On a failed save, a creature takes 4d8 necrotic damage and is frightened of you for 1 minute. On a successful save, the creature takes half damage and isn't frightened. This item requires attunement.",
    "descriptors": [],
    "name": "Reaper's Embrace (Plate Armor)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 2047,
    "description": "While wearing this armor, you gain a +1 bonus to AC. When you take bludgeoning, piercing, or slashing damage, your next weapon attack before the end of your next turn deals an extra 1d6 force damage. This item requires attunement.",
    "descriptors": [],
    "name": "Rippling Force Mail (Chain Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 525,
    "description": "While wearing this armor and you have half your hit points or fewer, when a creature within 5 feet hits you with a melee attack, that creature takes 1d4 piercing damage. This item requires attunement.",
    "descriptors": [],
    "name": "Robust Chain Shirt (Chain Shirt)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 555,
    "description": "While wearing this armor, you gain a +1 bonus to Dexterity (Stealth) checks.",
    "descriptors": [],
    "name": "Scarlet Leather Armor (Leather Armor)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 3840,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +1 bonus to Dexterity (Stealth) checks. While you are in dim light or darkness, you have advantage on saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Shadeclinger Armor (Padded Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3845,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +1 bonus to Dexterity (Stealth) checks. While you are in dim light or darkness, you have advantage on saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Shadeclinger Armor (Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 3845,
    "description": "While wearing this armor, you gain a +1 bonus to AC and a +1 bonus to Dexterity (Stealth) checks. While you are in dim light or darkness, you have advantage on saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Shadeclinger Armor (Studded Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 8350,
    "description": "While wearing this armor, you can add your full Dexterity modifier (instead of a maximum of 2) to your AC. Creatures have disadvantage on saving throws to resist your attacks, spells, or effects that would restrain them. This item requires attunement.",
    "descriptors": [],
    "name": "Sharpened Snare Cuirass (Breastplate)",
    "rarity": "Very Rare",
    "type": "Armor"
  },
  {
    "cost": 525,
    "description": "While wearing this armor, when you restore hit points to a creature, that creature automatically disengages and doesn't provoke opportunity attacks until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "Slippery Chain Shirt",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 2640,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +1 bonus to Dexterity (Stealth) checks, and advantage on Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Spidersilk Armor (Padded Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 2645,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +1 bonus to Dexterity (Stealth) checks, and advantage on Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Spidersilk Armor (Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 2645,
    "description": "While wearing this armor, you gain a +1 bonus to AC, a +1 bonus to Dexterity (Stealth) checks, and advantage on Constitution saving throws. This item requires attunement.",
    "descriptors": [],
    "name": "Spidersilk Armor (Studded Leather Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 560,
    "description": "When a creature within 5 feet hits you with a melee attack, the attacker must succeed on a DC 14 Dexterity saving throw or be unable to take reactions until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Jolty Vest (Hide Armor)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 550,
    "description": "When a creature within 5 feet hits you with a melee attack, the attacker must succeed on a DC 14 Dexterity saving throw or be unable to take reactions until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Jolty Vest (Chain Shirt)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 550,
    "description": "When a creature within 5 feet hits you with a melee attack, the attacker must succeed on a DC 14 Dexterity saving throw or be unable to take reactions until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Jolty Vest (Scale Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 550,
    "description": "When a creature within 5 feet hits you with a melee attack, the attacker must succeed on a DC 14 Dexterity saving throw or be unable to take reactions until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Jolty Vest (Breastplate)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 550,
    "description": "When a creature within 5 feet hits you with a melee attack, the attacker must succeed on a DC 14 Dexterity saving throw or be unable to take reactions until the start of its next turn. This item requires attunement.",
    "descriptors": [],
    "name": "The Jolty Vest (Half Plate)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 571,
    "description": "While wearing this armor, when an undead creature hits you with a melee attack, it takes 1d6 radiant damage. If the attacker is a beast, it deal an additional 1d6 radiant damage to you. This item requires attunement.",
    "descriptors": [],
    "name": "The Oakfather's Embrace (Hide Armor)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 561,
    "description": "While wearing this armor, when an undead creature hits you with a melee attack, it takes 1d6 radiant damage. If the attacker is a beast, it deal an additional 1d6 radiant damage to you. This item requires attunement.",
    "descriptors": [],
    "name": "The Oakfather's Embrace (Chain Shirt)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 561,
    "description": "While wearing this armor, when an undead creature hits you with a melee attack, it takes 1d6 radiant damage. If the attacker is a beast, it deal an additional 1d6 radiant damage to you. This item requires attunement.",
    "descriptors": [],
    "name": "The Oakfather's Embrace (Scale Mail)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 561,
    "description": "While wearing this armor, when an undead creature hits you with a melee attack, it takes 1d6 radiant damage. If the attacker is a beast, it deal an additional 1d6 radiant damage to you. This item requires attunement.",
    "descriptors": [],
    "name": "The Oakfather's Embrace (Breastplate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 561,
    "description": "While wearing this armor, when an undead creature hits you with a melee attack, it takes 1d6 radiant damage. If the attacker is a beast, it deal an additional 1d6 radiant damage to you. This item requires attunement.",
    "descriptors": [],
    "name": "The Oakfather's Embrace (Half Plate)",
    "rarity": "Uncommon",
    "type": "Armor"
  },
  {
    "cost": 1120,
    "description": "While wearing this armor, you can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. You have resistance to fire damage.",
    "descriptors": [],
    "name": "Unwanted Masterwork Scalemail (Scale Mail)",
    "rarity": "Rare",
    "type": "Armor"
  },
  {
    "cost": 1110,
    "description": "While wearing this armor, you can add your full Dexterity modifier (instead of a maximum of 2) to your AC. This armor doesn't impose disadvantage on Dexterity (Stealth) checks. You gain a +1 bonus to initiative rolls. This item requires attunement.",
    "name": "Yuan-Ti Scale Mail (Scale Mail)",
    "rarity": "Rare",
    "type": "Armor"
  }
]
